{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"package": {
			"add.browser.breakpoint": "Afegir punt d'interrupció del navegador",
			"attach.node.process": "Connectar amb el procés de Node",
			"base.cascadeTerminateToConfigurations.label": "Llista de sessions de depuració que també es detindran quan acabi aquesta sessió de depuració.",
			"browser.address.description": "L'adreça IP o el nom de l'host on escolta el navegador depurat.",
			"browser.attach.port.description": "Port a utilitzar per a la depuració remota del navegador, indicat com \"--remote-debugging-port\" en iniciar el navegador.",
			"browser.baseUrl.description": "Adreça URL base per resoldre rutes d'accés baseUrl. baseURL es retalla quan s'assignen adreces URL a fitxers del disc. El valor predeterminat és el domini de l'adreça URL d'inici.",
			"browser.browserAttachLocation.description": "Força que el navegador s'associï en una ubicació. En un entorn de treball remot (per exemple, mitjançant SSH o WSL) es pot utilitzar per associar-se a un navegador a la màquina remota, en lloc de localment.",
			"browser.browserLaunchLocation.description": "Força que el navegador s'iniciï en una ubicació. En un entorn de treball remot (per exemple, mitjançant SSH o WSL), es pot utilitzar per obrir el navegador a la màquina remota en lloc de localment.",
			"browser.cleanUp.description": "Neteja que s'ha de fer després d'acabar la sessió de depuració. Es pot tancar només la pestanya que s'està depurant o bé tancar tot el navegador.",
			"browser.cwd.description": "Directori de treball opcional per al fitxer executable de l'entorn d'execució.",
			"browser.disableNetworkCache.description": "Controla si s'omet la memòria cau de xarxa per a cada sol·licitud.",
			"browser.env.description": "Diccionari opcional de parells clau/valor d'entorn per al navegador.",
			"browser.file.description": "Fitxer HTML local per obrir-lo en el navegador.",
			"browser.includeDefaultArgs.description": "Si els arguments predeterminats d'inici del navegador (per desactivar les funcions que poden dificultar la depuració) s'inclouran en el llançament.",
			"browser.includeLaunchArgs.description": "Avançat: si s'estableixen arguments predeterminats d'inici o depuració en el navegador. El depurador assumirà que el navegador utilitzarà depuració de canalització, com la que es proporciona amb \"--remote-debugging-pipe\".",
			"browser.inspectUri.description": "Format que s'utilitzarà per reescriure el valor inspectUri: és una cadena de plantilla que interpola les claus en ''{curlyBraces}\". Les claus disponibles són:\r\n - \"url.*\" és l'adreça analitzada de l'aplicació en execució. Per exemple, ''{url.port}\", \"{url.hostname}'\r\n'. - \"port\" és el port de depuració on Chrome està escoltant.\r\n - \"browserInspectUri\" és el URI de l'inspector en el navegador iniciat.\r\n - \"browserInspectUriPath\" és la part del camí d'accés del URI de l'inspector en el navegador iniciat (per exemple, \"/devtools/browser/e9ec0098-306e-472a-8133-5e42488929c2\").\r\n - \"wsProtocol\" és el protocol websocket suggerit. S'estableix en \"wss\" si l'adreça URL original és \"https\"o en \"ws\" en cas contrari.",
			"browser.launch.port.description": "Port on escolta el navegador. S'estableix de manera predeterminada en \"0\", cosa que provoca que el navegador es depuri mitjançant canalitzacions. Això sol ser més segur i s'ha de triar tret que calgui adjuntar el navegador des d'una altra eina.",
			"browser.pathMapping.description": "Assignació d'adreces URL/rutes a carpetes locals, per resoldre scripts al navegador a scripts en disc.",
			"browser.perScriptSourcemaps.description": "Especifica si els scripts es carreguen de forma individual amb mapes d'origen únics que continguin el nom base del fitxer de codi font. Pot establir-se per optimitzar el tractament dels mapes d'origen quan es treballa amb un gran volum de scripts petits. Si s'estableix en \"Automàtic\", es detectaran casos coneguts en què aquesta operació sigui adequada.",
			"browser.profileStartup.description": "Si és true, la generació de perfils començarà tan aviat com s'iniciï el procés.",
			"browser.restart": "Si s'ha de reconnectar si està tancada la connexió del navegador.",
			"browser.revealPage": "Pestanya de focus",
			"browser.runtimeArgs.description": "Arguments opcionals passats a l'executable de l'entorn d'execució.",
			"browser.runtimeExecutable.description": "\"canary\", \"stable\", \"custom\" o ruta a l'executable del navegador. Si es tria \"custom\", pot ser un encapsulador ajustable, una compilació ajustable o una variable d'entorn CHROME_PATH.",
			"browser.runtimeExecutable.edge.description": "Pot ser un \"valor controlat\", \"estable\", desenvolupament, \"personalitzat\" o una ruta d'accés a l'executable del navegador. El valor \"personalitzat\" significa un contenidor personalitzat, una compilació personalitzada o una variable d'entorn EDGE_PATH.",
			"browser.server.description": "Configura un servidor web perquè s'iniciï. Pren la mateixa configuració que la tasca de llançament \"node\".",
			"browser.skipFiles.description": "Matriu de noms de fitxer o carpeta, o patrons globals de ruta d'accés, que s'ometran durant la depuració. Es permeten patrons d'estrella i negacions, per exemple, \"[\"**/node_modules/**\", \"!**/node_modules/my-module/**\"]\".",
			"browser.smartStep.description": "Executa pas a pas línies no assignades de fitxers sense mapa d'origen de forma automàtica. Per exemple, codi que TypeScript produeix automàticament durant la compilació de async/await o altres característiques.",
			"browser.sourceMapPathOverrides.description": "Conjunt d'assignacions per reescriure les ubicacions dels fitxers d'origen en les seves ubicacions al disc, a partir del que indica el mapa d'origen. Consulteu el fitxer LÉAME per obtenir més detalls.",
			"browser.sourceMapRenames.description": "Indica si s'ha d'utilitzar l'assignació \"names\" en mapes d'origen. Per a això, és necessari sol·licitar contingut d'origen, que pot ser lent amb determinats depuradors.",
			"browser.sourceMaps.description": "S'utilitzen els mapes d'origen de JavaScript (si existeixen).",
			"browser.targetSelection": "Indica si s'ha d'adjuntar a totes les destinacions que coincideixin amb el filtre d'adreça URL (\"automàtic\") o se li demana que en seleccioni un (\"seleccionar\").",
			"browser.timeout.description": "Reintenta aquest nombre de mil·lisegons per connectar-se al navegador. El valor predeterminat és 10000 ms.",
			"browser.url.description": "Buscarà una pestanya amb aquesta URL exacta i l'adjuntarà, si es troba.",
			"browser.urlFilter.description": "Buscarà una pàgina amb aquesta adreça URL i, si la troba, associarà la depuració a ella. Pot tenir caràcters comodí (*).",
			"browser.userDataDir.description": "De manera predeterminada, el navegador s'inicia amb un perfil d'usuari independent en una carpeta temporal. Utilitzeu aquesta opció per invalidar-lo. Establiu-lo en false perquè s'iniciï amb el seu perfil d'usuari predeterminat. No es pot iniciar un nou navegador si ja s'està executant una instància des de \"userDataDir\".",
			"browser.vueComponentPaths": "Llista de patrons globals de fitxers per buscar components \"*.vue\". De manera predeterminada, busca en l'àrea de treball completa. Això s'ha d'especificar, a causa de les cerques addicionals que els mapes d'origen de Vue requereixen en la CLI de Vue 4. Per desactivar aquest tractament especial, establiu-lo en una matriu buida.",
			"browser.webRoot.description": "Especifica la ruta d'accés absoluta de l'àrea de treball a l'arrel del servidor web. S'utilitza per resoldre rutes d'accés del tipus \"/app.js\" a fitxers del disc. Forma abreujada per a l'assignació de rutes d'accés amb \"/\".",
			"chrome.attach.description": "Adjuntar a una instància de Chrome ja en mode de depuració.",
			"chrome.attach.label": "Chrome: Associar",
			"chrome.label": "Aplicació web (Chrome)",
			"chrome.launch.description": "Inicia Chrome per depurar una URL.",
			"chrome.launch.label": "Chrome: Inici",
			"commands.callersAdd.label": "Excloure l'autor de la trucada",
			"commands.callersAdd.paletteLabel": "Excloure l'autor de la trucada de la pausa a la ubicació actual",
			"commands.callersGoToCaller.label": "Anar a la ubicació de l'autor de la trucada",
			"commands.callersGoToTarget.label": "Anar a la ubicació de destinació",
			"commands.callersRemove.label": "Eliminar l'autor de la trucada exclòs",
			"commands.callersRemoveAll.label": "Eliminar tots els autors de la trucada exclosos",
			"commands.disableSourceMapStepping.label": "Desactivar l'execució pas a pas assignada d'origen",
			"commands.enableSourceMapStepping.label": "Activar l'execució pas a pas assignada d'origen",
			"configuration.autoAttachMode": "Configura els processos que s'associaran i depuraran automàticament quan \"#debug.node.autoAttach#\" estigui activat. Un procés de Node iniciat amb la marca \"--inspect\" s'associarà sempre, independentment d'aquesta configuració.",
			"configuration.autoAttachMode.always": "S'associa automàticament a tots els processos de Node.js iniciats en el terminal.",
			"configuration.autoAttachMode.disabled": "La connexió automàtica està desactivada i no es mostra a la barra d'estat.",
			"configuration.autoAttachMode.explicit": "Només es pot associar automàticament quan es proporciona la marca \"--inspect\".",
			"configuration.autoAttachMode.smart": "S'associa automàticament quan s'executen scripts que no estan en una carpeta node_modules.",
			"configuration.autoAttachSmartPatterns": "Configura patrons globals per determinar quan associar en mode \"smart\" \"#debug.javascript.autoAttachFilter#\". \"$KNOWN _TOOLS $\" es reemplaça per una llista de noms d'executors de proves i codi comuns. [Més informació a la documentació de VS Code](https://code.visualstudio.com/docs/nodejs/nodejs-debugging#_auto-attach-smart-patterns).",
			"configuration.automaticallyTunnelRemoteServer": "En depurar una aplicació web remota, s'estableix si s'ha de fer un túnel automàtic del servidor remot a l'equip local.",
			"configuration.breakOnConditionalError": "Controla si s'ha de detenir quan els punts d'interrupció condicionals produeixen un error.",
			"configuration.debugByLinkOptions": "Opcions utilitzades en depurar enllaços oberts en què s'ha fet clic des de dins del terminal de depuració. Es pot establir en \"false\" per desactivar aquest comportament.",
			"configuration.defaultRuntimeExecutables": "Valor predeterminat de \"runtimeExecutable\" que s'utilitza per a les configuracions d'inici, si no s'especifica un valor. Es pot utilitzar per configurar rutes d'accés personalitzades a Node.js o a les instal·lacions del navegador.",
			"configuration.npmScriptLensLocation": "Lloc on s'ha de mostrar una lent de codi \"Executar\" i \"Depurar\" en els scripts npm. Pot estar en tots, en scripts, sobre la secció de l'script o bé no mostrar-se mai.",
			"configuration.pickAndAttachOptions": "Opcions predeterminades que s'utilitzen en depurar un procés mitjançant la comanda \"Debug: Attach to Node.js Process\"",
			"configuration.resourceRequestOptions": "Opcions de sol·licitud que s'utilitzaran en carregar els recursos (com els mapes d'origen) en el depurador. Pot ser necessari configurar això si els mapes d'origen requereixen autenticació o l'ús d'un certificat autofirmat, per exemple. Les opcions s'utilitzen per crear una sol·licitud amb la biblioteca [\"got\"](https://github.com/sindresorhus/got).\r\n\r\nUn cas habitual per desactivar la comprovació de certificats pot realitzar-se si es passa \"{ \"https\": { \"rejectUnauthorized\": false } }\".",
			"configuration.terminalOptions": "Opcions d'inici predeterminades per al terminal de depuració de JavaScript i els scripts npm.",
			"configuration.unmapMissingSources": "Configura si el fitxer sense mapa d'origen on no es pot llegir el fitxer original es desassignarà automàticament. Si és false (predeterminat), es mostra un missatge.",
			"createDiagnostics.label": "Diagnosticar problemes de punt d'interrupció",
			"customDescriptionGenerator.description": "Personalitza la descripció de text que el depurador mostra per als objectes (variables locals, etc.). Exemples:\r\n      1. this.toString() // Truca a toString per imprimir tots els objectes\r\n.      2. this.customDescription ? this.customDescription() : defaultValue // Utilitza el mètode customDescription si està disponible, si no torna defaultValue.\r\n      3. function (def) { return this.customDescription ? this.customDescription() : def } // Utilitza el mètode customDescription si està disponible, si no torna defaultValue.",
			"customPropertiesGenerator.description": "Personalitza les propietats que es mostren per a un objecte en el depurador (variables locals, et c.). Exemples:\r\n    1. { ...this, extraProperty: '12345' } // Afegiu una propietat extraproperty 12345 a tots els objectes.\r\n    2. this.customProperties ? this.customProperties() : this // Utilitzeu el mètode customProperties, si està disponible; en cas contrari, utilitzeu les propietats d'aquest (les propietats predeterminades).\r\n    3. function () { return this.customDescription ? this.customDescription() : this } // Utilitzeu el mètode customDescription, si està disponible; en cas contrari, es tornen les propietats predeterminades.\r\n\r\n    En desús: aquesta és una implementació temporal d'aquesta característica fins que tinguem temps per implementar-la de la manera aquí descrita: https://github.com/microsoft/vscode/issues/102181",
			"debug.npm.edit": "Editar package.json",
			"debug.npm.noScripts": "No s'han trobat scripts npm al teu package.json",
			"debug.npm.noWorkspaceFolder": "Cal obrir una carpeta d'àrea de treball per depurar scripts npm.",
			"debug.npm.parseError": "No s'ha pogut llegir {0}: {1}",
			"debug.npm.script": "Depurar script npm",
			"debug.terminal.attach": "Associar al procés del terminal Node.js",
			"debug.terminal.label": "Terminal de depuració de JavaScript",
			"debug.terminal.program.description": "Comanda per executar al terminal iniciat. Si no es proporciona, el terminal s'obrirà sense iniciar un programa.",
			"debug.terminal.snippet.label": "Executeu \"npm start\" en un terminal de depuració",
			"debug.terminal.toggleAuto": "Alterna l'associació automàtica de Node.js del terminal",
			"debug.terminal.welcome": "[Terminal de depuració de JavaScript](command:extension.js-debug.createDebuggerTerminal)\r\n\r\nPots utilitzar el terminal de depuració de JavaScript per depurar els processos de Node.js que s'executen a la línia de comandes.",
			"debug.terminal.welcomeWithLink": "[Terminal de depuració de JavaScript](command:extension.js-debug.createDebuggerTerminal)\r\n\r\nPots utilitzar el terminal de depuració de JavaScript per depurar els processos de Node.js que s'executen a la línia de comandes.\r\n\r\n[Adreça URL de depuració](command:extension.js-debug.debugLink)",
			"debug.unverifiedBreakpoints": "No s'han pogut establir alguns dels punts d'interrupció. Si tens un problema, pots [solucionar problemes de la configuració d'inici](command:extension.js-debug.createDiagnostics).",
			"debugLink.label": "Obrir enllaç",
			"edge.address.description": "En depurar vistes web, l'adreça IP o el nom de l'host en què està escoltant la vista web. Es detectarà automàticament si no s'estableix.",
			"edge.attach.description": "Adjuntar a una instància de Microsoft Edge ja en mode de depuració.",
			"edge.attach.label": "Edge: Associar",
			"edge.label": "Aplicació web (Edge)",
			"edge.launch.description": "Iniciar Microsoft Edge per depurar una adreça URL.",
			"edge.launch.label": "Edge: Iniciar",
			"edge.port.description": "En depurar vistes web, el port al qual escolta el depurador de la vista web. Es detectarà automàticament si no es fixa.",
			"edge.useWebView.attach.description": "Objecte que conté el \"pipeName\" d'una canalització de depuració per a una Webview2 allotjada per UWP. Aquest és el valor \"MyTestSharedMemory\" al crear la canalització \"\\\\.\\pipe\\LOCAL\\MyTestSharedMemory\"",
			"edge.useWebView.launch.description": "Quan sigui \"veritat\", el depurador tractarà l'executable de l'entorn d'execució com una aplicació host que conté un element WebView que li permet depurar el contingut del script WebView.",
			"enableContentValidation.description": "Alterna si es comprova si el contingut dels arxius al disc coincideix amb el que s'ha carregat a l'entorn d'execució. Resulta útil en diversos escenaris i és necessari en altres, però pot causar problemes si, per exemple, s'aplica la transformació de scripts del costat del servidor.",
			"errors.timeout": "{0}: temps d'espera després de {1} ms",
			"extension.description": "Extensió per depurar programes Node.js i Chrome.",
			"extensionHost.label": "Desenvolupament d'extensions de VS Code",
			"extensionHost.launch.config.name": "Inici de l'extensió",
			"extensionHost.launch.debugWebWorkerHost": "Configura si s'ha de provar la connexió amb l'amfitrió d'extensions de treball web.",
			"extensionHost.launch.debugWebviews": "Configura si s'ha de provar d'adjuntar-se a vistes web a la instància de VS Code iniciada. Això només funcionarà a VS Code de taula.",
			"extensionHost.launch.env.description": "Variables d'entorn passades a l'amfitrió d'extensions.",
			"extensionHost.launch.rendererDebugOptions": "Opcions d'inici de Chrome que s'utilitzen en associar-se al procés de representador, amb \"debugWebviews\" o \"debugWebWorkerHost\".",
			"extensionHost.launch.runtimeExecutable.description": "Ruta absoluta a VS Code.",
			"extensionHost.launch.stopOnEntry.description": "L'amfitrió d'extensions es deté automàticament després de l'inici.",
			"extensionHost.snippet.launch.description": "Iniciar una extensió de VS Code en mode de depuració",
			"extensionHost.snippet.launch.label": "Desenvolupament d'extensions de VS Code",
			"getDiagnosticLogs.label": "Desar els registres de depuració JS de diagnòstic",
			"longPredictionWarning.disable": "No tornar a mostrar",
			"longPredictionWarning.message": "Els punts d'interrupció estan trigant a configurar-se. Podeu accelerar-ho actualitzant \"outFiles\" al vostre fitxer launch.json.",
			"longPredictionWarning.noFolder": "No hi ha cap carpeta de l'àrea de treball oberta.",
			"longPredictionWarning.open": "Obrir launch.json",
			"node.address.description": "Adreça TCP/IP del procés que es vol depurar. El valor predeterminat és \"localhost\".",
			"node.attach.attachExistingChildren.description": "Si s'intenta adjuntar-se a processos secundaris ja generats.",
			"node.attach.attachSpawnedProcesses.description": "Si s'han d'establir variables d'entorn al procés adjunt per fer un seguiment dels elements secundaris generats.",
			"node.attach.config.name": "Adjuntar",
			"node.attach.continueOnAttach": "Si és veritat, reanudarem automàticament els programes iniciats i esperant en \"--inspect-brk\"",
			"node.attach.processId.description": "Identificador del procés al qual s'ha d'associar.",
			"node.attach.restart.description": "Intenteu tornar a connectar-vos al programa si es perd la connexió. Si es fixa en \"true\", s'intentarà una vegada per segon, per sempre. En el seu lloc, podeu personalitzar l'interval i el nombre màxim d'intents mitjançant la especificació dels valors \"delay\" i \"maxAttempts\" en un objecte.",
			"node.attachSimplePort.description": "Si es fixa, s'associa al procés a través del port especificat. Això generalment ja no és necessari en programes de Node.js i es perd la capacitat de depurar els processos secundaris. No obstant això, pot ser útil en escenaris més esotèrics, com en els llançaments de Deno i Docker. Si es fixa en 0, es triarà un port aleatori i es afegirà --inspect-brk als arguments d'inici de manera automàtica.",
			"node.console.title": "Consola de depuració de nodes",
			"node.disableOptimisticBPs.description": "No establir punts d'interrupció en cap fitxer fins que s'hagi carregat un mapa de fonts per al fitxer.",
			"node.enableTurboSourcemaps.description": "Configura si s'ha de fer servir un mecanisme nou i més ràpid per a la detecció de mapes de fonts",
			"node.killBehavior.description": "Configura el mode en què acaben els processos de depuració en aturar la sessió. Pot ser:\r\n\r\n- forceful (predeterminat): anul·la de manera forçosa l'arbre de processos. Envia SIGKILL en posix o \"taskkill.exe /F\" en Windows.\r\n- polite: anul·la correctament l'arbre de processos. És possible que els processos amb un comportament erroni continuïn executant-se després d'apagar d'aquesta manera. Envia SIGTERM en posix o \"taskkill.exe\" sense la marca \"/F\" (forçar) en Windows.\r\n- none: no es produirà cap terminació.",
			"node.label": "Node.js",
			"node.launch.args.description": "Arguments de línia de comandes que es passen al programa.\r\n\r\nPot ser una matriu de cadenes o una sola cadena. Quan el programa s'inicia en un terminal, establir aquesta propietat en una sola cadena farà que els arguments no es fugin per al shell.",
			"node.launch.autoAttachChildProcesses.description": "Associeu automàticament el depurador als processos secundaris nous.",
			"node.launch.config.name": "Iniciar",
			"node.launch.console.description": "Lloc on ha de començar el destí de depuració.",
			"node.launch.console.externalTerminal.description": "Terminal extern que es pot configurar des de la Configuració de l'usuari.",
			"node.launch.console.integratedTerminal.description": "Terminal integrat de VS Code",
			"node.launch.console.internalConsole.description": "Consola de depuració de VS Code (que no admet la lectura d'entrades d'un programa)",
			"node.launch.cwd.description": "Ruta d'accés absoluta al directori de treball del programa que s'està depurant. Si heu establert localRoot, cwd coincidirà amb aquest valor; en cas contrari, es revertirà al vostre workspaceFolder.",
			"node.launch.env.description": "Variables d'entorn passades al programa. El valor \"null\" elimina la variable de l'entorn.",
			"node.launch.envFile.description": "Ruta d'accés absoluta a un fitxer que conté definicions de variables d'entorn.",
			"node.launch.logging": "Configuració de registre",
			"node.launch.logging.cdp": "Ruta al fitxer de registre per als missatges del protocol DevTools de Chrome",
			"node.launch.logging.dap": "Ruta d'accés al fitxer de registre per als missatges del Protocol d'adaptador de depuració",
			"node.launch.outputCapture.description": "Ubicació des d'on es capturaran els missatges de sortida: l'API de depuració predeterminada si es fixa en \"console\" o les seqüències stdout/stderr si es fixa en \"std\".",
			"node.launch.program.description": "Ruta d'accés absoluta al programa. El valor generat s'infereix de package.json i dels fitxers oberts. Editeu aquest atribut.",
			"node.launch.restart.description": "Proveu de reiniciar el programa si es tanca amb un codi de sortida diferent de zero.",
			"node.launch.runtimeArgs.description": "Arguments opcionals passats a l'executable de l'entorn d'execució.",
			"node.launch.runtimeExecutable.description": "Entorn d'execució que s'ha de fer servir. Pot ser una ruta d'accés absoluta o el nom d'un entorn d'execució disponible a PATH. Si es deixa en blanc, s'utilitzarà \"node\".",
			"node.launch.runtimeSourcemapPausePatterns": "Llista de patrons en els quals s'insereixen manualment punts d'interrupció de punt d'entrada. Pot ser útil per proporcionar al depurador una oportunitat per establir punts d'interrupció en utilitzar mapes de fonts que no existeixen o que no es poden detectar abans d'iniciar, com [amb Serverless Framework](https://github.com/microsoft/vscode-js-debug/issues/492).",
			"node.launch.runtimeVersion.description": "Versió de l'entorn d'execució de \"Node\" que s'ha de fer servir. Requereix \"NVM\".",
			"node.launch.useWSL.deprecation": "\"useWSL\" està en desús i es eliminarà el suport corresponent. Utilitzeu l'extensió \"Remote - WSL\" en el seu lloc.",
			"node.launch.useWSL.description": "Utilitzeu el subsistema de Windows per a Linux.",
			"node.localRoot.description": "Ruta d'accés al directori local que conté el programa.",
			"node.pauseForSourceMap.description": "Si voleu esperar que es carreguin els mapes de fonts per a cada script entrant. Això té una sobrecàrrega de rendiment i es pot desactivar de manera segura quan us quedeu sense espai al disc, sempre que \"rootPath\" no estigui desactivat.",
			"node.port.description": "El port de depuració al qual s'ha d'associar. El valor predeterminat és 9229.",
			"node.processattach.config.name": "Associar al procés",
			"node.profileStartup.description": "Si és cert, començarà a generar perfils tan bon punt s'iniciï el procés.",
			"node.remote.host.header.description": "Encapçalament host explícit que s'ha d'utilitzar quan es connecti al websocket de l'inspector. Si no es especifica, l'encapçalament d'host es fixarà a \"localhost\". Això és útil quan l'inspector s'executa darrere d'un proxy que només accepta un encapçalament d'host determinat.",
			"node.remoteRoot.description": "Ruta d'accés absoluta al directori remot que conté el programa.",
			"node.resolveSourceMapLocations.description": "Llista de patrons de minimatch per a ubicacions (carpetes i adreces URL) en què es poden utilitzar mapes de fonts per resoldre fitxers locals. Es pot utilitzar per evitar la interrupció incorrecta en el codi assignat de fonts externes. Els patrons es poden prefixar amb \"!\" per excloure'ls. Es pot establir en una matriu buida o nul·la per evitar restriccions.",
			"node.showAsyncStacks.description": "Mostra les crides asincròniques que condueixen a la pila de trucades actual.",
			"node.snippet.attach.description": "Adjuntar a un node en execució",
			"node.snippet.attach.label": "Node.js: Adjuntar",
			"node.snippet.attachProcess.description": "Obrir el selector de processos per triar el procés de Node al qual connectar-se",
			"node.snippet.attachProcess.label": "Node.js: adjuntar a procés",
			"node.snippet.electron.description": "Depurar el procés principal d'Electron",
			"node.snippet.electron.label": "Node.js: procés principal d'Electron",
			"node.snippet.gulp.description": "Depurar tasca de Gulp (assegureu-vos de tenir Gulp instal·lat localment al projecte)",
			"node.snippet.gulp.label": "Node.js: tasca de Gulp",
			"node.snippet.launch.description": "Iniciar un programa de Node en mode de depuració",
			"node.snippet.launch.label": "Node.js: iniciar programa",
			"node.snippet.mocha.description": "Depurar proves de Mocha",
			"node.snippet.mocha.label": "Node.js: proves de Mocha",
			"node.snippet.nodemon.description": "Utilitza nodemon per reiniciar una sessió de depuració quan hi hagi canvis en el codi",
			"node.snippet.nodemon.label": "Node.js: configuració de Nodemon",
			"node.snippet.npm.description": "Inicia un programa de Node amb un script \"debug\" de npm.",
			"node.snippet.npm.label": "Node.js: iniciar mitjançant npm",
			"node.snippet.remoteattach.description": "Adjuntar al port de depuració d'un programa de node remot",
			"node.snippet.remoteattach.label": "Node.js: adjuntar a programa remot",
			"node.snippet.yo.description": "Depurar generador de Yeoman (es necessita instal·lar executant \"npm link\" a la carpeta del projecte).",
			"node.snippet.yo.label": "Node.js: generador de Yeoman",
			"node.sourceMapPathOverrides.description": "Un conjunt de mapeigs per reescriure les ubicacions dels fitxers de codi font amb el que indiquen els mapes de fonts, a les seves ubicacions al disc.",
			"node.sourceMaps.description": "Es fan servir els mapes de fonts de JavaScript (si existeixen).",
			"node.stopOnEntry.description": "El programa es deté automàticament després de l'inici.",
			"node.timeout.description": "Torna a provar amb aquest nombre de mil·lisegons per connectar-se a Node.js. El valor predeterminat és 10000 ms.",
			"node.versionHint.description": "Permet especificar explícitament la versió de node que s'està executant, que es pot utilitzar per desactivar o activar determinats comportaments en els casos en què la detecció automàtica de versions no funciona.",
			"node.websocket.address.description": "Adreça exacta de WebSocket a la qual s'ha d'associar. Si no es especifica, es detectarà a partir de l'adreça i el port.",
			"openEdgeDevTools.label": "Obrir les eines de desenvolupament del navegador",
			"outFiles.description": "Si els mapes de fonts estan habilitats, aquests patrons globals especifiquen els fitxers JavaScript generats. Si un patró comença amb '!', els fitxers s'exclouen. Si no es especifica, el codi generat s'espera al mateix directori que el seu origen.",
			"pretty.print.script": "Impressió bonica per a depuració",
			"profile.start": "Agafar el perfil de rendiment",
			"profile.stop": "Aturar el perfil de rendiment",
			"remove.browser.breakpoint": "Eliminar punt d'interrupció del navegador",
			"remove.browser.breakpoint.all": "Eliminar tots els punts d'interrupció del navegador",
			"requestCDPProxy.label": "Sol·licitar proxy de CDP per a la sessió de depuració",
			"skipFiles.description": "Una matriu de patrons globals perquè els fitxers es ometin a l'hora de depurar. El patró \"<node_internals>/**\" coincideix amb tots els mòduls interns de Node.js.",
			"smartStep.description": "Explora automàticament el codi generat que no es pot tornar a assignar al codi font original.",
			"start.with.stop.on.entry": "Iniciar depuració i aturar-la després de l'inici",
			"startWithStopOnEntry.label": "Iniciar depuració i aturar-la després de l'inici",
			"timeouts.generalDescription": "Temps d'espera de diverses operacions del depurador",
			"timeouts.generalDescription.markdown": "Temps d'espera de diverses operacions del depurador",
			"timeouts.hoverEvaluation.description": "Temps fins que s'anuli l'avaluació del valor dels símbols en mantenir el cursor. Si es fixa en 0, l'avaluació en mantenir el ratolí mai es queda sense temps d'espera.",
			"timeouts.sourceMaps.description": "Temps d'espera relacionats amb les operacions de mapes de fonts",
			"timeouts.sourceMaps.sourceMapCumulativePause.description": "Temps extra en mil·lisegons permès per cada sessió per esperar que es processin les assignacions de fonts, després que s'esgoti el temps mínim (sourceMapMinPause)",
			"timeouts.sourceMaps.sourceMapMinPause.description": "Temps mínim en mil·lisegons dedicat a esperar que cada assignació de fonts es processi quan s'està analitzant un script",
			"toggle.skipping.this.file": "Canviar i ometre aquest fitxer",
			"trace.boolean.description": "El seguiment es pot establir a \"true\" per escriure registres de diagnòstic al disc.",
			"trace.description": "Configura quina sortida de diagnòstic es produeix.",
			"trace.logFile.description": "Configura on es escriuen els registres al disc.",
			"trace.stdio.description": "Si desitja retornar dades de seguiment des de l'aplicació o el navegador iniciats.",
			"workspaceTrust.description": "Es necessita confiança per depurar el codi d'aquesta àrea de treball."

		},
		"bundle": {
			"A profiling session is already running, would you like to stop it and start a new session?": "Ja s'està executant una sessió de generació de perfils. Voleu aturar-la i iniciar una nova sessió?",
			"Adjust glob pattern(s) in the 'outFiles' attribute so that they cover the generated JavaScript.": "Ajusteu els patrons globals a l'atribut 'outFiles' perquè cobreixin el JavaScript generat.",
			"Always": "Sempre",
			"Always in this Workspace": "Sempre en aquest espai de treball",
			"An error occurred taking a profile from the target.": "S'ha produït un error en prendre un perfil de l'objectiu.",
			"Animation Frame Fired": "Fotograma d'animació activat",
			"Assertion failed": "Error d'asserció",
			"Attach to process: '{0}' doesn't look like a process id.": "Adjuntar al procés: '{0}' no sembla un id de procés.",
			"Attach to process: cannot enable debug mode for process '{0}' ({1}).": "Adjuntar al procés: no es pot habilitar el mode de depuració per al procés '{0}' ({1}).",
			"Attribute 'runtimeVersion' requires Node.js version manager 'nvm-windows' or 'nvs'.": "L'atribut 'runtimeVersion' requereix el gestor de versions de Node.js 'nvm-windows' o 'nvs'.",
			"Attribute 'runtimeVersion' requires Node.js version manager 'nvs' or 'nvm' to be installed.": "L'atribut 'runtimeVersion' requereix que s'instal·li el gestor de versions de Node.js 'nvs' o 'nvm'.",
			"Attribute 'runtimeVersion' with a flavor/architecture requires 'nvs' to be installed.": "L'atribut 'runtimeVersion' amb un sabor/arquitectura requereix que s'instal·li 'nvs'.",
			"Block": "Bloquejar",
			"Breaks on all throw errors, even if they're caught later.": "S'interromp en tots els errors de llançament, fins i tot si es capturen més tard.",
			"Breaks only on errors or promise rejections that are not handled.": "Només s'interromp en cas d'errors o rebutjos de promeses que no es gestionen.",
			"CPU Profile": "Perfil de CPU",
			"CPU profile saved as \"{0}\" in your workspace folder": "Perfil de CPU desat com a \"{0}\" a la carpeta del vostre espai de treball",
			"CSP violation \"{0}\"": "Violació de CSP \"{0}\"",
			"Can't find Node.js binary \"{0}\": {1}. Make sure Node.js is installed and in your PATH, or set the \"runtimeExecutable\" in your launch.json": "No es pot trobar el binari de Node.js \"{0}\": {1}. Assegureu-vos que Node.js estigui instal·lat i al vostre PATH, o establiu el \"runtimeExecutable\" al vostre launch.json",
			"Can't load environment variables from file ({0}).": "No es poden carregar les variables d'entorn del fitxer ({0}).",
			"Cancel Animation Frame": "Cancel·lar el fotograma d'animació",
			"Cannot connect to the target at {0}: {1}": "No es pot connectar amb l'objectiu a {0}: {1}",
			"Cannot find a program to debug": "No es pot trobar un programa per depurar",
			"Cannot launch debug target in terminal ({0}).": "No es pot iniciar l'objectiu de depuració al terminal ({0}).",
			"Cannot restart asynchronous frame": "No es pot reiniciar un fotograma asíncron",
			"Cannot set an empty value": "No es pot establir un valor buit",
			"Catch Block": "Bloc catch",
			"Caught Exceptions": "Excepcions capturades",
			"Close AudioContext": "Tancar AudioContext",
			"Closure": "Tancament",
			"Closure ({0})": "Tancament ({0})",
			"Console profile started": "Perfil de consola iniciat",
			"Could not connect to any UWP Webview pipe. Make sure your webview is hosted in debug mode, and that the `pipeName` in your `launch.json` is correct.": "No s'ha pogut connectar a cap canonada de vista web UWP. Assegureu-vos que la vostra vista web estigui allotjada en mode de depuració i que el `pipeName` al vostre `launch.json` sigui correcte.",
			"Could not query the provided object": "No s'ha pogut consultar l'objecte proporcionat",
			"Could not read source map for {0}: {1}": "No s'ha pogut llegir el mapa de font per a {0}: {1}",
			"Could not read {0}: {1}": "No s'ha pogut llegir {0}: {1}",
			"Create AudioContext": "Crear AudioContext",
			"Create canvas context": "Crear context del llenç",
			"Debug Anyway": "Depurar de totes maneres",
			"Debug URL": "Depurar URL",
			"Details": "Detalls",
			"Don't show again": "No mostrar de nou",
			"Duration": "Durada",
			"Duration of Profile": "Durada del perfil",
			"Edit package.json": "Editar package.json",
			"Enables Node.js [auto attach]({0}) debugging/{Locked='[auto attach]({0})'}": "Habilita la depuració de Node.js [auto attach]({0})",
			"Eval": "Eval",
			"Frame could not be restarted": "No s'ha pogut reiniciar el marc",
			"Generates a .cpuprofile file you can open in the Chrome devtools": "Genera un fitxer .cpuprofile que podeu obrir a les eines de desenvolupament de Chrome",
			"Generates a .heapprofile file you can open in the Chrome devtools": "Genera un fitxer .heapprofile que podeu obrir a les eines de desenvolupament de Chrome",
			"Generates a .heapsnapshot file you can open in the Chrome devtools": "Genera un fitxer .heapsnapshot que podeu obrir a les eines de desenvolupament de Chrome",
			"Global": "Global",
			"Got it!": "Entès!",
			"Heap Profile": "Perfil de pila",
			"Heap Snapshot": "Instantània de la pila",
			"How long to run the profile:": "Quant de temps s'executarà el perfil:",
			"Ignore": "Ignorar",
			"Invalid expression": "Expressió no vàlida",
			"Invalid hit condition \"{0}\". Expected an expression like \"> 42\" or \"== 2\".": "Condició de coincidència \"{0}\" no vàlida. S'esperava una expressió com \"> 42\" o \"== 2\".",
			"It looks like a browser is already running from {0}. Please close it before trying to debug, otherwise VS Code may not be able to connect to it.": "Sembla que ja s'està executant un navegador des de {0}. Si us plau, tanca'l abans d'intentar depurar, d'altra manera VS Code potser no podrà connectar-s'hi.",
			"It looks like your debug session has already ended. Try debugging again, then run the \"Debug: Diagnose Breakpoint Problems\" command.": "Sembla que la teva sessió de depuració ja ha finalitzat. Intenta depurar de nou, després executa la comanda \"Depuració: Diagnosticar problemes de punts d'interrupció\".",
			"It's taking a while to configure your breakpoints. You can speed this up by updating the 'outFiles' in your launch.json.": "Està trigant una estona a configurar els teus punts d'interrupció. Pots accelerar-ho actualitzant els 'outFiles' al teu launch.json.",
			"JavaScript Debug Terminal": "Terminal de depuració de JavaScript",
			"JavaScript debug adapter": "Adaptador de depuració de JavaScript",
			"Launch Chrome against localhost": "Iniciar Chrome contra localhost",
			"Launch Edge against localhost": "Iniciar Edge contra localhost",
			"Launch Program": "Iniciar el programa",
			"Launch configuration created based on 'package.json'.": "Configuració d'inici creada basada en 'package.json'.",
			"Launch configuration for '{0}' project created.": "S'ha creat la configuració d'inici per al projecte '{0}'.",
			"Local": "Local",
			"Lost connection to debugee, reconnecting in {0}ms\r\n": "S'ha perdut la connexió amb l'element a depurar, reconnectant en {0}ms\r\n",
			"Manual": "Manual",
			"Module": "Mòdul",
			"Never": "Mai",
			"No": "No",
			"No npm scripts found in your package.json": "No s'han trobat scripts npm al teu package.json",
			"No package.json files found in your workspace.": "No s'han trobat fitxers package.json al teu espai de treball.",
			"No workspace folder open.": "No hi ha cap carpeta d'espai de treball oberta.",
			"Node.js version '{0}' not installed using version manager {1}.": "La versió de Node.js '{0}' no està instal·lada utilitzant el gestor de versions {1}.",
			"Not Now": "Ara no",
			"Only objects can be queried": "Només es poden consultar objectes",
			"Open launch.json": "Obrir launch.json",
			"Output has been truncated to the first {0} characters. Run `{1}` to copy the full output.": "La sortida s'ha truncat als primers {0} caràcters. Executa `{1}` per copiar la sortida completa.",
			"Paused": "En pausa",
			"Paused before Out Of Memory exception": "En pausa abans de l'excepció de falta de memòria",
			"Paused on Content Security Policy violation instrumentation breakpoint, directive \"{0}\"": "En pausa en un punt d'interrupció d'instrumentació de violació de la Política de Seguretat de Contingut, directiva \"{0}\"",
			"Paused on DOM breakpoint": "En pausa en un punt d'interrupció del DOM",
			"Paused on WebGL Error instrumentation breakpoint, error \"{0}\"": "En pausa en un punt d'interrupció d'instrumentació d'error de WebGL, error \"{0}\"",
			"Paused on XMLHttpRequest or fetch": "En pausa en XMLHttpRequest o fetch",
			"Paused on assert": "En pausa en una afirmació",
			"Paused on breakpoint": "En pausa en un punt d'interrupció",
			"Paused on debug() call": "En pausa en una crida a debug()",
			"Paused on debugger statement": "En pausa en una declaració de depurador",
			"Paused on event listener": "En pausa en un escoltador d'esdeveniments",
			"Paused on event listener breakpoint \"{0}\", triggered on \"{1}\"": "En pausa en un punt d'interrupció d'escoltador d'esdeveniments \"{0}\", activat a \"{1}\"",
			"Paused on exception": "En pausa en una excepció",
			"Paused on frame entry": "En pausa en l'entrada d'un marc",
			"Paused on instrumentation breakpoint": "En pausa en un punt d'interrupció d'instrumentació",
			"Paused on instrumentation breakpoint \"{0}\"": "En pausa en un punt d'interrupció d'instrumentació \"{0}\"",
			"Paused on {0}": "En pausa a {0}",
			"Pick Breakpoint": "Escull un punt d'interrupció",
			"Pick the node.js process to attach to": "Escull el procés de node.js al qual adjuntar-se",
			"Please enter a number": "Si us plau, introdueix un número",
			"Please enter a number greater than 1": "Si us plau, introdueix un número més gran que 1",
			"Please stop the running profile before starting a new one.": "Si us plau, atura el perfil en execució abans de començar-ne un de nou.",
			"Process picker failed ({0})": "Ha fallat el selector de processos ({0})",
			"Profile duration in seconds, e.g \"5\"": "Durada del perfil en segons, per exemple \"5\"",
			"Profiling": "Perfilant",
			"Profiling with breakpoints enabled can change the performance of your code. It can be useful to validate your findings with the \"duration\" or \"manual\" termination conditions.": "Perfilar amb punts d'interrupció activats pot canviar el rendiment del teu codi. Pot ser útil validar els teus resultats amb les condicions de finalització \"durada\" o \"manual\".",
			"Read More": "Llegir més",
			"Request Animation Frame": "Sol·licitar marc d'animació",
			"Resume AudioContext": "Reprendre AudioContext",
			"Return value": "Valor de retorn",
			"Run Current File": "Executar el fitxer actual",
			"Run Script: {0}": "Executar script: {0}",
			"Run for a specific amount of time": "Executar durant un temps específic",
			"Run until a specific breakpoint is hit": "Executar fins que s'arribi a un punt d'interrupció específic",
			"Run until manually stopped": "Executar fins que s'aturi manualment",
			"Saving": "Desant",
			"Script": "Script",
			"Script Blocked by Content Security Policy": "Script bloquejat per la Política de Seguretat de Contingut",
			"Script First Statement": "Primera declaració del script",
			"Select a tab": "Selecciona una pestanya",
			"Select current working directory for new terminal": "Selecciona el directori de treball actual per al nou terminal",
			"Select the page where you want to open the devtools": "Selecciona la pàgina on vols obrir les eines de desenvolupament",
			"Select the session you want to inspect:": "Selecciona la sessió que vols inspeccionar:",
			"Set innerHTML": "Establir innerHTML",
			"Skipped by skipFiles": "Omès per skipFiles",
			"Skipped by smartStep": "Omès per smartStep",
			"Some breakpoints might not work in your version of Node.js. We recommend upgrading for the latest bug, performance, and security fixes. Details: https://aka.ms/AAcsvqm": "Alguns punts d'interrupció podrien no funcionar en la vostra versió de Node.js. Recomanem actualitzar per obtenir les últimes correccions d'errors, rendiment i seguretat. Detalls: https://aka.ms/AAcsvqm",
			"Source not a source map": "La font no és un mapa de font",
			"Source not found": "No s'ha trobat la font",
			"Stack frame not found": "No s'ha trobat el marc de pila",
			"Starting profile...": "Iniciant el perfil...",
			"Stopping profile...": "Aturant el perfil...",
			"Suspend AudioContext": "Suspendre AudioContext",
			"Syntax error setting breakpoint with condition {0} on line {1}: {2}": "Error de sintaxi en establir el punt d'interrupció amb la condició {0} a la línia {1}: {2}",
			"Target page not found. You may need to update your \"urlFilter\" to match the page you want to debug.": "No s'ha trobat la pàgina de destinació. Potser haureu d'actualitzar el vostre \"urlFilter\" perquè coincideixi amb la pàgina que voleu depurar.",
			"The Node version in \"{0}\" is outdated (version {1}), we require at least Node 8.x.": "La versió de Node a \"{0}\" està obsoleta (versió {1}), requerim com a mínim Node 8.x.",
			"The URL provided is invalid": "L'URL proporcionada no és vàlida.",
			"The browser process exited with code {0} before connecting to the debug server. Make sure the `runtimeExecutable` is configured correctly and that it can run without errors.": "El procés del navegador ha sortit amb el codi {0} abans de connectar-se al servidor de depuració. Assegureu-vos que el `runtimeExecutable` estigui configurat correctament i que pugui executar-se sense errors.",
			"The configured `cwd` {0} does not exist.": "El `cwd` {0} configurat no existeix.",
			"The configured `cwd` {0} is not a folder.": "El `cwd` {0} configurat no és una carpeta.",
			"This is a missing file path referenced by a sourcemap. Would you like to debug the compiled version instead?": "Aquesta és una ruta de fitxer que falta referenciada per un mapa de fonts. Voleu depurar la versió compilada en el seu lloc?",
			"Thread is not paused": "El fil no està en pausa",
			"Thread is not paused on exception": "El fil no està en pausa per l'excepció",
			"Thread not found": "No s'ha trobat el fil",
			"Type of profile:": "Tipus de perfil:",
			"UWP webview debugging is not available on your platform.": "La depuració de webview UWP no està disponible a la vostra plataforma.",
			"Unable to attach to browser": "No es pot adjuntar al navegador",
			"Unable to evaluate": "No es pot avaluar",
			"Unable to evaluate on async stack frame": "No es pot avaluar en un marc de pila asíncron",
			"Unable to find an installation of the browser on your system. Try installing it, or providing an absolute path to the browser in the \"runtimeExecutable\" in your launch.json.": "No es pot trobar una instal·lació del navegador al vostre sistema. Proveu d'instal·lar-lo o proporcioneu una ruta absoluta al navegador al \"runtimeExecutable\" del vostre launch.json.",
			"Unable to find {0} version {1}. Available auto-discovered versions are: {2}. You can set the \"runtimeExecutable\" in your launch.json to one of these, or provide an absolute path to the browser executable.": "No es pot trobar la versió {1} de {0}. Les versions descobertes automàticament disponibles són: {2}. Podeu establir el \"runtimeExecutable\" al vostre launch.json a una d'aquestes, o proporcionar una ruta absoluta a l'executable del navegador.",
			"Unable to launch browser: \"{0}\"": "No es pot iniciar el navegador: \"{0}\"",
			"Unable to pause": "No es pot pausar",
			"Unable to pretty print": "No es pot imprimir amb format",
			"Unable to resume": "No es pot reprendre",
			"Unable to retrieve source content": "No es pot recuperar el contingut de la font",
			"Unable to set variable value": "No es pot establir el valor de la variable",
			"Unable to step in": "No es pot entrar",
			"Unable to step next": "No es pot fer el següent pas",
			"Unable to step out": "No es pot sortir",
			"Unbound breakpoint": "Punt d'interrupció no vinculat",
			"Uncaught Exceptions": "Excepcions no capturades",
			"Unknown error": "Error desconegut",
			"Variable not found": "No s'ha trobat la variable",
			"Variables not available in async stacks": "Les variables no estan disponibles en piles asíncrones",
			"WARNING: Processing source-maps of {0} took longer than {1} ms so we continued execution without waiting for all the breakpoints for the script to be set.": "ADVERTÈNCIA: El processament dels mapes de fonts de {0} ha trigat més de {1} ms, així que hem continuat l'execució sense esperar que s'establissin tots els punts d'interrupció per al script.",
			"We can't launch a browser in debug mode from here. If you want to debug this webpage, open this workspace from VS Code on your desktop.": "No podem iniciar un navegador en mode de depuració des d'aquí. Si voleu depurar aquesta pàgina web, obriu aquest espai de treball des de VS Code al vostre escriptori.",
			"We can't launch a browser in debug mode from here. Open this workspace in VS Code on your desktop to enable debugging.": "No podem iniciar un navegador en mode de depuració des d'aquí. Obriu aquest espai de treball a VS Code al vostre escriptori per habilitar la depuració.",
			"WebGL Error Fired": "S'ha produït un error de WebGL",
			"WebGL Warning Fired": "S'ha produït una advertència de WebGL",
			"With Block": "Amb bloc",
			"Would you like to save a configuration in your launch.json for easy access later?": "Voleu desar una configuració al vostre launch.json per accedir-hi fàcilment més endavant?",
			"Yes": "Sí",
			"You need to open a workspace folder to debug npm scripts.": "Cal obrir una carpeta d'espai de treball per depurar scripts npm.",
			"You're running an outdated version of Node.js. We recommend upgrading for the latest bug, performance, and security fixes.": "Esteu executant una versió obsoleta de Node.js. Recomanem actualitzar per obtenir les últimes correccions d'errors, rendiment i seguretat.",
			"an old debug session": "una sessió de depuració antiga",
			"breakpoint.provisionalBreakpoint": "breakpoint.provisionalBreakpoint",
			"path does not exist": "la ruta no existeix",
			"process id: {0} ({1})": "id del procés: {0} ({1})",
			"process id: {0}, debug port: {1} ({2})": "id del procés: {0}, port de depuració: {1} ({2})",
			"setInterval fired": "setInterval activat",
			"setTimeout fired": "setTimeout activat",
			"the configured userDataDir": "el userDataDir configurat",
			"{0} (couldn't describe: {1})": "{0} (no s'ha pogut descriure: {1})",
			"{0} Click to Stop Profiling": "{0} Feu clic per aturar el perfilatge",
			"{0} Click to Stop Profiling ({1} sessions)": "{0} Feu clic per aturar el perfilatge ({1} sessions)",
			"{0} Click to Stop Profiling ({1})": "{0} Feu clic per aturar el perfilatge ({1})"
		}
	}
}