{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"Example": "Exemple",
			"Files by Extension": "Fitxers per extensió",
			"Files with Extension": "Fitxers amb extensió",
			"Files with Multiple Extensions": "Fitxers amb múltiples extensions",
			"Files with Path": "Fitxers amb ruta",
			"Files with Siblings by Name": "Fitxers amb germans per nom",
			"Folder by Name (Any Location)": "Carpeta per nom (qualsevol ubicació)",
			"Folder by Name (Top Level)": "Carpeta per nom (nivell superior)",
			"Folders with Multiple Names (Top Level)": "Carpetes amb múltiples noms (nivell superior)",
			"GitHub": "GitHub",
			"Map all files matching the absolute path glob pattern in their path to the language with the given identifier.": "Assigna tots els fitxers que coincideixen amb el patró glob de ruta absoluta al llenguatge amb l'identificador donat.",
			"Map all files matching the glob pattern in their filename to the language with the given identifier.": "Assigna tots els fitxers que coincideixen amb el patró glob en el seu nom de fitxer al llenguatge amb l'identificador donat.",
			"Match a folder with a specific name in any location.": "Coincideix amb una carpeta amb un nom específic en qualsevol ubicació.",
			"Match a top level folder with a specific name.": "Coincideix amb una carpeta de nivell superior amb un nom específic.",
			"Match all files of a specific file extension.": "Coincideix amb tots els fitxers d'una extensió específica.",
			"Match all files with any of the file extensions.": "Coincideix amb tots els fitxers amb qualsevol de les extensions de fitxer.",
			"Match files that have siblings with the same name but a different extension.": "Coincideix amb fitxers que tenen germans amb el mateix nom però una extensió diferent.",
			"Match multiple top level folders.": "Coincideix amb múltiples carpetes de nivell superior.",
			"The character used by the operating system to separate components in file paths": "El caràcter utilitzat pel sistema operatiu per separar components en les rutes de fitxers",
			"The current opened file": "El fitxer actualment obert",
			"The current opened file relative to ${workspaceFolder}": "El fitxer actualment obert relatiu a ${workspaceFolder}",
			"The current opened file's basename": "El nom base del fitxer actualment obert",
			"The current opened file's basename with no file extension": "El nom base del fitxer actualment obert sense extensió",
			"The current opened file's dirname": "El nom del directori del fitxer actualment obert",
			"The current opened file's dirname relative to ${workspaceFolder}": "El nom del directori del fitxer actualment obert relatiu a ${workspaceFolder}",
			"The current opened file's extension": "L'extensió del fitxer actualment obert",
			"The current selected line number in the active file": "El número de línia actualment seleccionat en el fitxer actiu",
			"The current selected text in the active file": "El text actualment seleccionat en el fitxer actiu",
			"The name of the default build task. If there is not a single default build task then a quick pick is shown to choose the build task.": "El nom de la tasca de compilació per defecte. Si no hi ha una única tasca de compilació per defecte, es mostra una selecció ràpida per triar la tasca de compilació.",
			"The name of the folder opened in VS Code without any slashes (/)": "El nom de la carpeta oberta a VS Code sense cap barra inclinada (/)",
			"The path of the folder opened in VS Code": "La ruta de la carpeta oberta a VS Code",
			"The path where an an extension is installed.": "La ruta on s'instal·la una extensió.",
			"The task runner's current working directory on startup": "El directori de treball actual de l'executor de tasques a l'inici",
			"Use the language of the currently active text editor if any": "Utilitza l'idioma de l'editor de text actualment actiu, si n'hi ha",
			"a conditional separator (' - ') that only shows when surrounded by variables with values": "un separador condicional (' - ') que només es mostra quan està envoltat de variables amb valors",
			"an indicator for when the active editor has unsaved changes": "un indicador per quan l'editor actiu té canvis no desats",
			"e.g. SSH": "p. ex. SSH",
			"e.g. VS Code": "p. ex. VS Code",
			"file path of the workspace (e.g. /Users/Development/myWorkspace)": "ruta del fitxer de l'espai de treball (p. ex. /Users/Development/myWorkspace)",
			"file path of the workspace folder the file is contained in (e.g. /Users/Development/myFolder)": "ruta del fitxer de la carpeta de l'espai de treball on es troba el fitxer (p. ex. /Users/Development/myFolder)",
			"gist": "gist",
			"name of the workspace folder the file is contained in (e.g. myFolder)": "nom de la carpeta de l'espai de treball on es troba el fitxer (p. ex. myFolder)",
			"name of the workspace with optional remote name and workspace indicator if applicable (e.g. myFolder, myRemoteFolder [SSH] or myWorkspace (Workspace))": "nom de l'espai de treball amb nom remot opcional i indicador d'espai de treball si és aplicable (p. ex. myFolder, myRemoteFolder [SSH] o myWorkspace (Workspace))",
			"shortened name of the workspace without suffixes (e.g. myFolder or myWorkspace)": "nom abreujat de l'espai de treball sense sufixos (p. ex. myFolder o myWorkspace)",
			"the file name (e.g. myFile.txt)": "el nom del fitxer (p. ex. myFile.txt)",
			"the full path of the file (e.g. /Users/Development/myFolder/myFileFolder/myFile.txt)": "la ruta completa del fitxer (p. ex. /Users/Development/myFolder/myFileFolder/myFile.txt)",
			"the full path of the folder the file is contained in (e.g. /Users/Development/myFolder/myFileFolder)": "la ruta completa de la carpeta on es troba el fitxer (p. ex. /Users/Development/myFolder/myFileFolder)",
			"the name of the folder the file is contained in (e.g. myFileFolder)": "el nom de la carpeta on es troba el fitxer (p. ex. myFileFolder)",
			"the path of the file relative to the workspace folder (e.g. myFolder/myFileFolder/myFile.txt)": "la ruta del fitxer relativa a la carpeta de l'espai de treball (p. ex. myFolder/myFileFolder/myFile.txt)",
			"the path of the folder the file is contained in, relative to the workspace folder (e.g. myFolder/myFileFolder)": "la ruta de la carpeta on es troba el fitxer, relativa a la carpeta de l'espai de treball (p. ex. myFolder/myFileFolder)"
		},
		"package": {
			"description": "Proporciona funcionalitats (IntelliSense avançat, autocorrecció) en fitxers de configuració, com ara fitxers de configuració, d'inici i de recomanació d'extensions.",
			"displayName": "Edició de configuració"
		}
	}
}