{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"$ref \\'{0}\\' in \\'{1}\\' can not be resolved.": "$ref \\'{0}\\' en \\'{1}\\' no es pot resoldre.",
			"<empty>": "<empty>",
			"A default value. Used by suggestions.": "Valor predeterminat. Usat per suggeriments.",
			"A descriptive title of the element.": "Títol descriptiu de l'element.",
			"A long description of the element. Used in hover menus and suggestions.": "Descripció llarga de l'element. S'utilitza en menús i suggeriments al mantenir el punter.",
			"A map of property names to either an array of property names or a schema. An array of property names means the property named in the key depends on the properties in the array being present in the object in order to be valid. If the value is a schema, then the schema is only applied to the object if the property in the key exists on the object.": "Assignació de noms de propietat a una matriu de noms de propietat o a un esquema. Una matriu de noms de propietat significa que la propietat denominada en la clau depèn de les propietats de la matriu presents en l'objecte per a que siguin vàlides. Si el valor és un esquema, l'esquema només s'aplica a l'objecte si la propietat de la clau existeix en l'objecte.",
			"A map of property names to schemas for each property.": "Assignació de noms de propietat a esquemes per a cada propietat.",
			"A map of regular expressions on property names to schemas for matching properties.": "Assignació d'expressions regulars en noms de propietat a esquemes per a propietats coincidents.",
			"A number that should cleanly divide the current value (i.e. have no remainder).": "Nombre que hauria de dividir netament el valor actual (és a dir, que no quedi resta).",
			"A regular expression to match the string against. It is not implicitly anchored.": "Expressió regular amb la qual fer coincidir la cadena. No està delimitat implícitament.",
			"A schema which must not match.": "L'esquema que no ha de coincidir.",
			"A unique identifier for the schema.": "Identificador únic de l'esquema.",
			"An array instance is valid against \\\"contains\\\" if at least one of its elements is valid against the given schema.": "Una instància de matriu és vàlida per \\\"contains\\\" si almenys un dels seus elements és vàlid amb l'esquema especificat.",
			"An array of schemas, all of which must match.": "Matriu d'esquemes, tots els quals han de coincidir.",
			"An array of schemas, exactly one of which must match.": "Una matriu d'esquemes, exactament una de les quals ha de coincidir.",
			"An array of schemas, where at least one must match.": "Una matriu d'esquemes, on almenys un ha de coincidir.",
			"An array of strings that lists the names of all properties required on this object.": "Matriu de cadenes que enumera els noms de totes les propietats necessàries en aquest objecte.",
			"An instance validates successfully against this keyword if its value is equal to the value of the keyword.": "Una instància es valida correctament amb aquesta paraula clau si el seu valor és igual al valor de la paraula clau.",
			"Array does not contain required item.": "La matriu no conté l'element necessari.",
			"Array has duplicate items.": "La matriu té elements duplicats.",
			"Array has too few items that match the contains contraint. Expected {0} or more.": "La matriu té molt pocs elements que coincideixen amb el limitador de contingut. S'esperava {0} o més.",
			"Array has too few items. Expected {0} or more.": "La matriu té molt pocs elements. S'esperaven {0} o més.",
			"Array has too many items according to schema. Expected {0} or fewer.": "La matriu té massa elements segons l'esquema. S'esperava {0} o menys.",
			"Array has too many items that match the contains contraint. Expected {0} or less.": "La matriu té massa elements que coincideixen amb el limitador de contingut. S'esperava {0} o menys.",
			"Array has too many items. Expected {0} or fewer.": "La matriu té massa elements. S'esperaven {0} o menys.",
			"Colon expected": "S'esperaven dos punts",
			"Comments are not permitted in JSON.": "No es permeten comentaris en JSON.",
			"Comments from schema authors to readers or maintainers of the schema.": "Comentaris dels autors de l'esquema als lectors o mantenidors de l'esquema.",
			"Configure": "Configurar",
			"Configured by extension: {0}": "Configurat per extensió: {0}",
			"Configured in user settings": "Configurat en la configuració d'usuari",
			"Configured in workspace settings": "Configurat en la configuració de l'àrea de treball",
			"Default value": "Valor predeterminat",
			"Describes the content encoding of a string property.": "Descriu la codificació de contingut d'una propietat de cadena.",
			"Describes the format expected for the value.": "Descriu el format esperat per al valor.",
			"Describes the media type of a string property.": "Descriu el tipus de mitjà d'una propietat de cadena.",
			"Downloading schemas is disabled through setting \\'{0}\\'": "La descàrrega d'esquemes està deshabilitada mitjançant el valor \\'{0}\\'",
			"Downloading schemas is disabled. Click to configure.": "La descàrrega d'esquemes està deshabilitada. Feu clic per configurar.",
			"Draft-03 schemas are not supported.": "No s'admeten esquemes esborrany-03.",
			"Duplicate anchor declaration: \\'{0}\\'": "Declaració de delimitador duplicada: \\'{0}\\'",
			"Duplicate object key": "Clau d'objecte duplicada",
			"Either a schema or a boolean. If a schema, then used to validate all properties not matched by 'properties' or 'patternProperties'. If false, then any properties not matched by either will cause this schema to fail.": "Esquema o booleà. Si és un esquema, s'utilitzarà per validar totes les propietats que no coincideixin amb \"properties\" o \"patternProperties\". Si és fals, les propietats que no coincideixin amb qualsevol provocaran un error en aquest esquema.",
			"Either a string of one of the basic schema types (number, integer, null, array, object, boolean, string) or an array of strings specifying a subset of those types.": "Cadena d'un dels tipus d'esquema bàsics (nombre, enter, null, matriu, objecte, booleà, cadena) o una matriu de cadenes que especifica un subconjunt d'aquests tipus.",
			"End of file expected.": "S'esperava el final del fitxer.",
			"Expected a JSON object, array or literal.": "S'esperava un objecte JSON, una matriu o un literal.",
			"Expected comma": "S'esperava una coma",
			"Expected comma or closing brace": "S'esperava una coma o un claudàtor de tancament",
			"Expected comma or closing bracket": "S'esperava una coma o un claudàtor de tancament",
			"Failed to sort the JSONC document, please consider opening an issue.": "No s'ha pogut ordenar el document JSONC. Considereu la possibilitat d'obrir una incidència.",
			"For arrays, only when items is set as an array. If it is a schema, then this schema validates items after the ones specified by the items array. If it is false, then additional items will cause validation to fail.": "Per a matrius, només quan els elements s'estableixin com una matriu. Si es tractés d'un esquema, aquest esquema validarà els elements després dels especificats per la matriu d'elements. Si és fals, els elements addicionals provocaran un error de validació.",
			"For arrays. Can either be a schema to validate every element against or an array of schemas to validate each item against in order (the first schema will validate the first element, the second schema will validate the second element, and so on.": "Per a matrius. Pot ser un esquema amb el qual validar cada element o una matriu d'esquemes per validar cada element en ordre (el primer esquema validarà el primer element, el segon esquema validarà el segon element, i així successivament.",
			"If all of the items in the array must be unique. Defaults to false.": "Si tots els elements de la matriu han de ser únics. El valor predeterminat és false.",
			"If the instance is an object, this keyword validates if every property name in the instance validates against the provided schema.": "Si la instància és un objecte, aquesta paraula clau valida si tots els noms de propietat de la instància es validen amb l'esquema proporcionat.",
			"Incorrect type. Expected \"{0}\".": "Tipus incorrecte. S'esperava \"{0}\".",
			"Incorrect type. Expected one of {0}.": "Tipus incorrecte. S'esperava un de {0}.",
			"Indicates that the value of the instance is managed exclusively by the owning authority.": "Indica que el valor de la instància està administrat exclusivament per l'autoritat propietària.",
			"Invalid characters in string. Control characters must be escaped.": "Caràcters no vàlids en la cadena. Els caràcters de control han de tenir caràcters d'escapament.",
			"Invalid color format. Use #RGB, #RGBA, #RRGGBB or #RRGGBBAA.": "Format de color no vàlid. Utilitzeu #RGB, #RGBA, #RRGGBB o #RRGGBBAA.",
			"Invalid escape character in string.": "Caràcter d'escapament no vàlid en la cadena.",
			"Invalid number format.": "Format numèric no vàlid.",
			"Invalid unicode sequence in string.": "Seqüència Unicode no vàlida en la cadena.",
			"Item does not match any validation rule from the array.": "L'element no coincideix amb cap regla de validació de la matriu.",
			"JSON Language Server": "Servidor de llenguatge JSON",
			"JSON Outline Status": "Estat de l'esquema JSON",
			"JSON Validation Status": "Estat de validació JSON",
			"JSON schema cache cleared.": "Esborrada la memòria cau de l'esquema JSON.",
			"JSON schema configured": "Esquema JSON configurat",
			"JSON: Schema Resolution Error": "JSON: Error de resolució d'esquemes",
			"Learn more about JSON schema configuration...": "Més informació sobre la configuració de l'esquema JSON...",
			"Loading JSON info": "Carregant informació JSON",
			"Makes the maximum property exclusive.": "Fa exclusiva la propietat màxima.",
			"Makes the minimum property exclusive.": "Fa que la propietat mínima sigui exclusiva.",
			"Matches a schema that is not allowed.": "Coincideix amb un esquema no permès.",
			"Matches multiple schemas when only one must validate.": "Coincideix amb diversos esquemes quan només s'ha de validar un.",
			"Missing property \"{0}\".": "Falta la propietat \"{0}\".",
			"New array": "Nova matriu",
			"New object": "Nou objecte",
			"No Schema Validation": "Sense validació d'esquema",
			"No schema configured for this file": "No hi ha cap esquema configurat per a aquest fitxer",
			"Not used for validation. Place subschemas here that you wish to reference inline with $ref.": "No s'utilitza per a la validació. Col·loqueu aquí els subesquemes als quals vulgueu fer referència alineada amb $ref.",
			"Object has fewer properties than the required number of {0}": "L'objecte té menys propietats que el nombre requerit de {0}",
			"Object has more properties than limit of {0}.": "L'objecte té més propietats que el límit de {0}.",
			"Object is missing property {0} required by property {1}.": "A l'objecte li falta la propietat {0} requerida per la propietat {1}.",
			"Open Extension": "Obrir l'extensió",
			"Open Settings": "Obrir configuració",
			"Outline": "Esquema",
			"Problem reading content from \\'{0}\\': UTF-8 with BOM detected, only UTF 8 is allowed.": "Problema en llegir el contingut de \\'{0}\\': UTF-8 amb BOM detectat, només es permet UTF 8.",
			"Problems loading reference \\'{0}\\': {1}": "Problemes en carregar la referència \\'{0}\\': {1}",
			"Property expected": "Propietat esperada",
			"Property keys must be doublequoted": "Les claus de propietat han de tenir cometes dobles",
			"Property {0} is not allowed.": "No es permet la propietat {0}.",
			"Reference a definition hosted on any location.": "Referenciar a una definició allotjada en qualsevol ubicació.",
			"Sample JSON values associated with a particular schema, for the purpose of illustrating usage.": "Valors JSON d'exemple associats a un esquema concret amb la finalitat d'il·lustrar l'ús.",
			"Schema Validated": "Esquema validat",
			"Select the schema to use for {0}": "Seleccioneu l'esquema que s'utilitzarà per a {0}",
			"Show Schemas": "Mostrar esquemes",
			"String does not match the pattern of \"{0}\".": "La cadena no coincideix amb el patró de \"{0}\".",
			"String is longer than the maximum length of {0}.": "La cadena és més gran que la longitud màxima de {0}.",
			"String is not a RFC3339 date-time.": "La cadena no és una data i hora RFC3339.",
			"String is not a RFC3339 date.": "La cadena no és una data RFC3339.",
			"String is not a RFC3339 time.": "La cadena no és una hora RFC3339.",
			"String is not a URI: {0}": "La cadena no és un URI: {0}",
			"String is not a hostname.": "La cadena no és un nom d'amfitrió.",
			"String is not an IPv4 address.": "La cadena no és una adreça IPv4.",
			"String is not an IPv6 address.": "La cadena no és una adreça IPv6.",
			"String is not an e-mail address.": "La cadena no és una adreça de correu electrònic.",
			"String is shorter than the minimum length of {0}.": "La cadena és més curta que la longitud mínima de {0}.",
			"The \\\"else\\\" subschema is used for validation when the \\\"if\\\" subschema fails.": "El subesquema \\\"else\\\" s'utilitza per a la validació quan el subesquema \\\"if\\\" no té èxit.",
			"The \\\"if\\\" subschema is used for validation when the \\\"if\\\" subschema succeeds.": "El subesquema \\\"if\\\" s'utilitza per a la validació quan el subesquema \\\"if\\\" té èxit.",
			"The maximum length of a string.": "La longitud màxima d'una cadena.",
			"The maximum number of items that can be inside an array. Inclusive.": "Nombre màxim d'elements que poden estar dins d'una matriu. Inclusiu.",
			"The maximum number of properties an object can have. Inclusive.": "Nombre màxim de propietats que pot tenir un objecte. Inclusiu.",
			"The maximum numerical value, inclusive by default.": "Valor numèric màxim, inclusiu de forma predeterminada.",
			"The minimum length of a string.": "Longitud mínima d'una cadena.",
			"The minimum number of items that can be inside an array. Inclusive.": "Nombre mínim d'elements que poden estar dins d'una matriu. Inclusiu.",
			"The minimum number of properties an object can have. Inclusive.": "Nombre mínim de propietats que pot tenir un objecte. Inclusiu.",
			"The minimum numerical value, inclusive by default.": "Valor numèric mínim, inclusiu de forma predeterminada.",
			"The schema to verify this document against.": "Esquema amb el qual es comprovarà aquest document.",
			"The schema uses meta-schema features ({0}) that are not yet supported by the validator.": "L'esquema utilitza característiques de metaesquema ({0}) que encara no són compatibles amb el validador.",
			"The set of literal values that are valid.": "Conjunt de valors literals que són vàlids.",
			"The validation outcome of the \\\"if\\\" subschema controls which of the \\\"then\\\" or \\\"else\\\" keywords are evaluated.": "El resultat de la validació del subesquema \\\"if\\\" controlarà quines paraules clau \\\"then\\\" o \\\"else\\\" s'avaluen.",
			"Trailing comma": "Coma final",
			"URI expected.": "S'esperava l'URI.",
			"URI is expected.": "S'espera l'URI.",
			"URI with a scheme is expected.": "S'espera l'URI amb un esquema.",
			"Unable to compute used schemas: No document": "No es poden calcular els esquemes usats: no hi ha documents",
			"Unable to compute used schemas: {0}": "No es poden calcular els esquemes usats: {0}",
			"Unable to load schema from \\'{0}\\'. No schema request service available": "No es pot carregar l'esquema des de \\'{0}\\'. No hi ha cap servei de sol·licitud d'esquema disponible",
			"Unable to load schema from \\'{0}\\': No content.": "No es pot carregar l'esquema des de \\'{0}\\': sense contingut.",
			"Unable to load schema from \\'{0}\\': {1}.": "No es pot carregar l'esquema des de \\'{0}\\': {1}.",
			"Unable to load {0}": "No es pot carregar {0}",
			"Unable to parse content from \\'{0}\\': Parse error at offset {1}.": "No es pot analitzar el contingut de \\'{0}\\': error d'anàlisi en el desplaçament {1}.",
			"Unable to resolve schema. Click to retry.": "No es pot resoldre l'esquema. Feu clic per tornar a intentar-ho.",
			"Unexpected end of comment.": "Final de comentari inesperat.",
			"Unexpected end of number.": "Final de nombre inesperat.",
			"Unexpected end of string.": "Final de cadena inesperat.",
			"Value expected": "S'esperava un valor",
			"Value is above the exclusive maximum of {0}.": "El valor està per sobre del màxim exclusiu de {0}.",
			"Value is above the maximum of {0}.": "El valor està per sobre del màxim de {0}.",
			"Value is below the exclusive minimum of {0}.": "El valor està per sota del mínim exclusiu de {0}.",
			"Value is below the minimum of {0}.": "El valor és inferior al mínim de {0}.",
			"Value is deprecated": "El valor està en desús",
			"Value is not accepted. Valid values: {0}.": "No s'accepta el valor. Valors vàlids: {0}.",
			"Value is not divisible by {0}.": "El valor no és divisible per {0}.",
			"Value must be {0}.": "El valor ha de ser {0}.",
			"multiple JSON schemas configured": "s'han configurat diversos esquemes JSON",
			"no JSON schema configured": "no hi ha cap esquema JSON configurat",
			"only {0} document symbols shown for performance reasons": "només es mostren {0} símbols del document per motius de rendiment"
		},
		"package": {
			"description": "Proporciona un potent suport de llenguatge per a fitxers JSON.",
			"displayName": "Característiques del llenguatge JSON",
			"json.clickToRetry": "Feu clic per tornar a intentar-ho.",
			"json.colorDecorators.enable.deprecationMessage": "El valor \"json.colorDecorators.enable\" està en desús en favor de \"editor.colorDecorators\".",
			"json.colorDecorators.enable.desc": "Habilita o deshabilita decoradors de color",
			"json.command.clearCache": "Esborrar la memòria cau de l'esquema",
			"json.command.sort": "Ordenar document",
			"json.enableSchemaDownload.desc": "Quan està habilitat, els esquemes JSON es poden capturar des de ubicacions http i https.",
			"json.format.enable.desc": "Habilitar o deshabilitar el formatejador JSON predeterminat",
			"json.format.keepLines.desc": "Conservar totes les línies noves existents en formatar.",
			"json.maxItemsComputed.desc": "El nombre màxim de símbols de l'esquema i regions de plegat calculats (limitat per motius de rendiment).",
			"json.maxItemsExceededInformation.desc": "Mostra una notificació quan se supera el nombre màxim de símbols d'esquema i de regions plegables.",
			"json.schemaResolutionErrorMessage": "No es pot resoldre l'esquema.",
			"json.schemas.desc": "Associa esquemes a fitxers JSON en el projecte actual.",
			"json.schemas.fileMatch.desc": "Una matriu de patrons de fitxer amb els quals buscar correspondència en resoldre fitxers JSON en esquemes. \"*\" es pot utilitzar com a comodí. Els patrons d'exclusió també es poden definir i començar amb \"!\". Un fitxer coincideix quan hi ha almenys un patró coincident i l'últim patró coincident no és un patró d'exclusió.",
			"json.schemas.fileMatch.item.desc": "Un patró de fitxer que pot contenir \"*\" amb el qual coincidir quan els fitxers JSON es resolguin en esquemes.",
			"json.schemas.schema.desc": "La definició d'esquema de l'adreça URL determinada. Només cal proporcionar l'esquema per evitar els accessos a l'adreça URL de l'esquema.",
			"json.schemas.url.desc": "Una adreça URL a un esquema o una ruta d'accés relativa a un esquema en el directori actual",
			"json.tracing.desc": "Realitza el seguiment de la comunicació entre VS Code i el servidor de llenguatge JSON.",
			"json.validate.enable.desc": "Habilita o deshabilita la validació json."
		}
	}
}