{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"Data URLs are not a valid image source.": "Les adreces URL de dades no són una font d'imatge vàlida.",
			"Embedded SVGs are not a valid image source.": "Els SVG incrustats no són una font d'imatge vàlida.",
			"Error parsing the when-clause:": "Error en analitzar la clàusula when:",
			"Images must use the HTTPS protocol.": "Les imatges han d'utilitzar el protocol HTTPS.",
			"Language specific editor settings": "Configuració de l'editor específica del llenguatge",
			"Override editor settings for language": "Sobreescriure la configuració de l'editor per al llenguatge",
			"Relative badge URLs require a repository with HTTPS protocol to be specified in this package.json.": "Les adreces URL relatives de distintius requereixen un repositori amb el protocol HTTPS especificat en aquest package.json.",
			"Relative image URLs require a repository with HTTPS protocol to be specified in the package.json.": "Les adreces URL relatives d'imatges requereixen un repositori amb el protocol HTTPS especificat en el package.json.",
			"SVGs are not a valid image source.": "Els SVG no són una font d'imatge vàlida.",
			"This activation event can be removed as VS Code generates these automatically from your package.json contribution declarations.": "Aquest esdeveniment d'activació es pot eliminar ja que VS Code els genera automàticament a partir de les declaracions de contribució del package.json.",
			"This activation event can be removed for extensions targeting engine version ^1.75 as VS Code will generate these automatically from your package.json contribution declarations.": "Aquest esdeveniment d'activació es pot eliminar per a les extensions destinades a la versió del motor ^1.75, ja que VS Code els generarà automàticament a partir de les declaracions de contribució del package.json.",
			"This activation event cannot be explicitly listed by your extension.": "La vostra extensió no pot enumerar explícitament aquest esdeveniment d'activació.",
			"This proposal cannot be used because for this extension the product defines a fixed set of API proposals. You can test your extension but before publishing you MUST reach out to the VS Code team.": "Aquesta proposta no es pot utilitzar perquè, per a aquesta extensió, el producte defineix un conjunt fix de propostes d'API. Podeu provar l'extensió, però abans de publicar-la HEU de contactar amb l'equip de VS Code.",
			"Using '*' activation is usually a bad idea as it impacts performance.": "L'ús de l'activació '*' sol ser una mala idea, ja que afecta el rendiment."
		},
		"package": {
			"description": "Proporciona funcionalitat de detecció d'errors per a la creació d'extensions.",
			"displayName": "Creació d'extensions"
		}
	}
}