{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"(Current Change)": "(Canvi actual)",
			"(Incoming Change)": "(Canvi entrant)",
			"Accept Both Changes": "Acceptar ambdós canvis",
			"Accept Current Change": "Acceptar canvi actual",
			"Accept Incoming Change": "Acceptar canvi entrant",
			"Compare Changes": "Comparar canvis",
			"Editor cursor is not within a merge conflict": "El cursor de l'editor no es troba en un conflicte de fusió",
			"Editor cursor is within the common ancestors block, please move it to either the \"current\" or \"incoming\" block": "El cursor de l'editor està dins del bloc d'ancestres comuns, si us plau, mogui'l al bloc \"actual\" o al \"entrant\"",
			"Editor cursor is within the merge conflict splitter, please move it to either the \"current\" or \"incoming\" block": "El cursor de l'editor està dins del separador de conflictes de fusió, mogui'l al bloc \"actual\" o al \"entrant\"",
			"No merge conflicts found in this file": "No s'han trobat conflictes de fusió en aquest arxiu",
			"No other merge conflicts within this file": "No hi ha més conflictes de fusió en aquest arxiu",
			"{0}: Current Changes ↔ Incoming Changes": "{0}: Canvis actuals ↔ Canvis entrants"
		},
		"package": {
			"command.accept.all-both": "Acceptar ambdós",
			"command.accept.all-current": "Acceptar tot actual",
			"command.accept.all-incoming": "Acceptar tots els entrants",
			"command.accept.both": "Acceptar ambdós",
			"command.accept.current": "Acceptar actuals",
			"command.accept.incoming": "Acceptar entrants",
			"command.accept.selection": "Acceptar selecció",
			"command.category": "Fusionar conflicte",
			"command.compare": "Comparar conflicte actual",
			"command.next": "Següent conflicte",
			"command.previous": "Conflicte anterior",
			"config.autoNavigateNextConflictEnabled": "Indica si, després de resoldre un conflicte de fusió mitjançant combinació, s'anirà automàticament al següent conflicte d'aquest tipus.",
			"config.codeLensEnabled": "Crear CodeLens per als blocs de conflictes de fusió mitjançant combinació en l'editor.",
			"config.decoratorsEnabled": "Crear elements Decorator per als blocs de conflictes de fusió mitjançant combinació en l'editor.",
			"config.diffViewPosition": "Controla on s'ha d'obrir la vista de diferències en comparar els canvis en els conflictes de combinació.",
			"config.diffViewPosition.below": "Obrir la vista de diferències sota el grup d'editor actual.",
			"config.diffViewPosition.beside": "Obrir la vista de diferències al costat del grup d'editor actual.",
			"config.diffViewPosition.current": "Obrir la vista de diferències en el grup d'editor actual.",
			"config.title": "Fusionar conflicte",
			"description": "Ressaltat i comandes per a conflictes de fusió inserida.",
			"displayName": "Fusionar conflicte"
		}
	}
}