{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"Continue to GitHub": "Continuar a GitHub",
			"Continue to GitHub to create a Personal Access Token (PAT)": "Continuar a GitHub per crear un token d'accés personal (PAT)",
			"Copy & Continue to GitHub": "Copiar i continuar a GitHub",
			"GitHub Enterprise Server URI is not a valid URI: {0}": "L'URI del servidor de GitHub Enterprise no és un URI vàlid: {0}",
			"Having trouble logging in? Would you like to try a different way? ({0})": "Té problemes per iniciar sessió? Vol provar d'una altra manera? ({0})",
			"No": "No",
			"Open [{0}]({0}) in a new tab and paste your one-time code: {1}/The [{0}]({0}) will be a url and the {1} will be a code, e.g. 123-456{Locked=\"[{0}]({0})\"}": "Obriu [{0}]({0}) en una pestanya nova i enganxeu el codi d'un sol ús: {1}",
			"Sign in failed: {0}": "Error d'inici de sessió: {0}",
			"Sign out failed: {0}": "Error en tancar sessió: {0}",
			"Signing in to {0}.../The {0} will be a url, e.g. github.com": "Iniciant sessió a {0}...",
			"To finish authenticating, navigate to GitHub and paste in the above one-time code.": "Per finalitzar l'autenticació, aneu a GitHub i enganxeu el codi d'un sol ús anterior.",
			"To finish authenticating, navigate to GitHub to create a PAT then paste the PAT into the input box.": "Per finalitzar l'autenticació, aneu a GitHub per crear un PAT i enganxeu el PAT al quadre d'entrada.",
			"Yes": "Sí",
			"You have not yet finished authorizing this extension to use GitHub. Would you like to try a different way? ({0})": "Encara no heu acabat d'autoritzar aquesta extensió per utilitzar GitHub. Vol provar d'una altra manera? ({0})",
			"Your Code: {0}/The {0} will be a code, e.g. 123-456": "El seu codi: {0}",
			"device code": "codi del dispositiu",
			"local server": "servidor local",
			"personal access token": "token d'accés personal"
		},
		"package": {
			"description": "Proveïdor d'autenticació de GitHub",
			"displayName": "Autenticació de GitHub"
		}
	}
}