{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"\"store\" a boolean test for later evaluation in a guard or if().": "\"emmagatzema\" una prova booleana per a una avaluació posterior en una guàrdia o if().",
			"'from' expected": "s'esperava 'from'",
			"'in' expected": "S'esperava 'in'",
			"'through' or 'to' expected": "s'esperava 'through' o 'to'",
			"'{0}'": "'{0}'",
			"( expected": "S'esperava (",
			") expected": "S'esperava )",
			"<undefined>": "<undefined>",
			"@font-face": "@font-face",
			"@font-face rule must define 'src' and 'font-family' properties": "La regla @font-face ha de definir les propietats 'src' i 'font-family'",
			"@keyframes {0}": "@keyframes {0}",
			"A list of properties that are not validated against the `unknownProperties` rule.": "Llista de propietats que no es validen contra la regla 'unknownProperties'.",
			"Adds quotes to a string.": "Afegeix cometes a una cadena.",
			"Also define the standard property '{0}' for compatibility": "Defineix també la propietat estàndard '{0}' per compatibilitat",
			"Always define standard rule '@keyframes' when defining keyframes.": "Defineix sempre la regla estàndard '@keyframes' quan defineixis fotogrames clau.",
			"Always include all vendor specific properties: Missing: {0}": "Inclou sempre totes les propietats específiques del proveïdor. Falta: {0}",
			"Always include all vendor specific rules: Missing: {0}": "Inclou sempre totes les regles específiques del proveïdor: falta: {0}",
			"Appends a single value onto the end of a list.": "Afegeix un únic valor al final d'una llista.",
			"Appends selectors to one another without spaces in between.": "Afegeix selectors entre si sense espais entre ells.",
			"Avoid using !important. It is an indication that the specificity of the entire CSS has gotten out of control and needs to be refactored.": "Evita utilitzar '!important'. És una indicació que l'especificitat de tot el CSS s'ha descontrolat i necessita ser refactoritzat.",
			"Avoid using 'float'. Floats lead to fragile CSS that is easy to break if one aspect of the layout changes.": "Et recomanem no utilitzar 'float'. Els valors float produeixen CSS vulnerables que es poden malmetre fàcilment si es canvia qualsevol aspecte del disseny.",
			"CSS Language Server": "Servidor de llenguatge CSS",
			"CSS fix is outdated and can\\'t be applied to the document.": "La correcció CSS està obsoleta i no es pot aplicar al document.",
			"Causes one or more rules to be emitted at the root of the document.": "Fa que s'emetin una o diverses regles a l'arrel del document.",
			"Changes one or more properties of a color.": "Canvia una o diverses propietats d'un color.",
			"Changes the alpha component for a color.": "Canvia el component alfa d'un color.",
			"Changes the hue of a color.": "Canvia el to d'un color.",
			"Combines several lists into a single multidimensional list.": "Combina diverses llistes en una sola llista multidimensional.",
			"Converts a color into the format understood by IE filters.": "Converteix un color en el format entès pels filtres IE.",
			"Converts a color to grayscale.": "Converteix un color a escala de grisos.",
			"Converts a string to lower case.": "Converteix una cadena a minúscules.",
			"Converts a string to upper case.": "Converteix una cadena a majúscules.",
			"Converts a unitless number to a percentage.": "Converteix un nombre sense unitat en un percentatge.",
			"Creates a Color from hue, saturation, and lightness values.": "Crea un color a partir de valors de to, saturació i lluminositat.",
			"Creates a Color from hue, saturation, lightness, and alpha values.": "Crea un color a partir de valors de to, saturació, lluminositat i alfa.",
			"Creates a Color from hue, white, and black values.": "Crea un color a partir de valors de to, blanc i negre.",
			"Creates a Color from lightness, a, and b values.": "Crea un color a partir dels valors de lluminositat, a i b.",
			"Creates a Color from lightness, chroma, and hue values.": "Crea un color a partir dels valors de lluminositat, croma i to.",
			"Creates a Color from red, green, and blue values.": "Crea un color a partir dels valors vermell, verd i blau.",
			"Creates a Color from red, green, blue, and alpha values.": "Crea un color a partir de valors vermells, verds, blaus i alfa.",
			"Creates a Color from the hue, saturation, and lightness values of another Color.": "Crea un color a partir dels valors de to, saturació i lluminositat d'un altre color.",
			"Creates a Color from the hue, white, and black values of another Color.": "Crea un color a partir dels valors de to, blanc i negre d'un altre color.",
			"Creates a Color from the lightness, a, and b values of another Color.": "Crea un color a partir dels valors de lluminositat, a i b d'un altre color.",
			"Creates a Color from the lightness, chroma, and hue values of another Color.": "Crea un color a partir dels valors de lluminositat, croma i to d'un altre color.",
			"Creates a Color from the red, green, and blue values of another Color.": "Crea un color a partir dels valors vermell, verd i blau d'un altre color.",
			"Creates a Color in a specific color space from red, green, and blue values.": "Crea un color en un espai de color específic a partir dels valors vermell, verd i blau.",
			"Creates a Color in a specific color space from the red, green, and blue values of another Color.": "Crea un color en un espai de color específic a partir dels valors vermell, verd i blau d'un altre color.",
			"Defines complex operations that can be re-used throughout stylesheets.": "Defineix operacions complexes que es poden reutilitzar en fulls d'estil.",
			"Defines styles that can be re-used throughout the stylesheet with `@include`.": "Defineix estils que es poden reutilitzar en tot el full d'estil amb '@include'.",
			"Do not use duplicate style definitions": "No utilitzis definicions d'estil duplicades",
			"Do not use empty rulesets": "No utilitzis conjunts de regles buits",
			"Do not use width or height when using padding or border": "No utilitzis l'amplada ni l'alçada quan utilitzis el farciment o la vora.",
			"Dynamically calls a Sass function.": "Crida dinàmicament una funció SASS.",
			"Each loop that sets `$var` to each item in the list or map, then outputs the styles it contains using that value of `$var`.": "Cada bucle que estableix '$var' a cada element de la llista o mapa i, a continuació, genera els estils que conté amb aquest valor de '$var'.",
			"Exposes the details of Sass's inner workings.": "Exposa els detalls del funcionament intern de Sass.",
			"Extends $extendee with $extender within $selector.": "Estén $extendee amb $extender dins de $selector.",
			"Extracts a substring from $string.": "Extreu una subcadena de $string.",
			"Failed to apply CSS fix to the document. Please consider opening an issue with steps to reproduce.": "No s'ha pogut aplicar la correcció CSS al document. Considera la possibilitat d'obrir una incidència amb els passos per reproduir-la.",
			"Finds the maximum of several numbers.": "Troba el màxim de diversos números.",
			"Finds the minimum of several numbers.": "Troba el mínim de diversos números.",
			"Fluidly scales one or more properties of a color.": "Escala de forma fluida una o diverses propietats d'un color.",
			"Folding Region End": "Fi de la regió plegable",
			"Folding Region Start": "Inici de la regió plegable",
			"For loop that repeatedly outputs a set of styles for each `$var` in the `from/through` or `from/to` clause.": "Bucle For que genera repetidament un conjunt d'estils per a cada '$var' en la clàusula 'from/through' o 'from/to'.",
			"Generates new colors based on existing ones, making it easy to build color themes.": "Genera nous colors basats en els existents, facilitant la creació de temes de color.",
			"Gets the blue component of a color.": "Obté el component blau d'un color.",
			"Gets the green component of a color.": "Obté el component verd d'un color.",
			"Gets the hue component of a color.": "Obté el component de to d'un color.",
			"Gets the lightness component of a color.": "Obté el component de lluminositat d'un color.",
			"Gets the opacity component of a color.": "Obté el component d'opacitat d'un color.",
			"Gets the red component of a color.": "Obté el component vermell d'un color.",
			"Gets the saturation component of a color.": "Obté el component de saturació d'un color.",
			"Hex colors must consist of three, four, six or eight hex numbers": "Els colors hexadecimals han de constar de tres, quatre, sis o vuit números hexadecimals",
			"IE hacks are only necessary when supporting IE7 and older": "Les modificacions d'IE només són necessàries quan es dóna suport a IE7 i versions anteriors.",
			"Import statements do not load in parallel": "Les instruccions Import no es carreguen en paral·lel.",
			"Includes the body if the expression does not evaluate to `false` or `null`.": "Inclou el cos si l'expressió no s'avalua com a 'false' o 'null'.",
			"Includes the styles defined by another mixin into the current rule.": "Inclou els estils definits per un altre mixin a la regla actual.",
			"Increases or decreases one or more components of a color.": "Augmenta o disminueix un o diversos components d'un color.",
			"Inherits the styles of another selector.": "Hereta els estils d'un altre selector.",
			"Inserts $insert into $string at $index.": "Insereix $insert a $string a $index.",
			"Invalid number of parameters": "Nombre de paràmetres incorrecte",
			"Joins together two lists into one.": "Combina dues llistes en una.",
			"Lets you access and modify values in lists.": "Permet accedir als valors de les llistes i modificar-los.",
			"Loads a Sass stylesheet and makes its mixins, functions, and variables available when this stylesheet is loaded with the @use rule.": "Carrega un full d'estil Sass i fa que els seus mixins, funcions i variables estiguin disponibles quan aquest full d'estil es carregui amb la regla @use.",
			"Loads mixins, functions, and variables from other Sass stylesheets as 'modules', and combines CSS from multiple stylesheets together.": "Carrega mixins, funcions i variables d'altres fulls d'estil SASS com a 'mòduls' i combina CSS de diversos fulls d'estil alhora.",
			"Makes a color darker.": "Fa que un color sigui més fosc.",
			"Makes a color less saturated.": "Fa que un color estigui menys saturat.",
			"Makes a color lighter.": "Fa que un color sigui més clar.",
			"Makes a color more opaque.": "Fa que un color sigui més opac.",
			"Makes a color more saturated.": "Fa que un color estigui més saturat.",
			"Makes a color more transparent.": "Fa que un color sigui més transparent.",
			"Makes it easy to combine, search, or split apart strings.": "Facilita la combinació, cerca o divisió de cadenes.",
			"Makes it possible to look up the value associated with a key in a map, and much more.": "Permet cercar el valor associat a una clau en un mapa i molt més.",
			"Merges two maps together into a new map.": "Combina dos mapes en un mapa nou.",
			"Mix two colors together in a polar color space.": "Combina dos colors en un espai de colors polar.",
			"Mix two colors together in a rectangular color space.": "Combina dos colors en un espai de colors rectangular.",
			"Mixes two colors together.": "Combina dos colors.",
			"Nests selector beneath one another like they would be nested in the stylesheet.": "Anida el selector sota un altre com si estigués anidat en un full d'estil.",
			"No unit for zero needed": "No es necessita cap unitat per a zero",
			"Parses a selector into the format returned by &.": "Analitza un selector en el format retornat per &.",
			"Prints the value of an expression to the standard error output stream. Useful for debugging complicated Sass files.": "Imprimeix el valor d'una expressió al flux de sortida d'error estàndard. Útil per depurar arxius Sass complicats.",
			"Prints the value of an expression to the standard error output stream. Useful for libraries that need to warn users of deprecations or recovering from minor mixin usage mistakes. Warnings can be turned off with the `--quiet` command-line option or the `:quiet` Sass option.": "Imprimeix el valor d'una expressió al flux de sortida d'error estàndard. És útil per a biblioteques que necessiten advertir als usuaris sobre obsolescències o recuperar-se d'errors lleus d'ús de mixin. Les advertències es poden desactivar amb l'opció de línia de comandes '--quiet' o l'opció de Sass ':quiet'.",
			"Property is ignored due to the display.": "La propietat s'ignora a causa de la pantalla.",
			"Property is ignored due to the display. With 'display: block', vertical-align should not be used.": "La propietat s'ignora a causa de la pantalla. Amb 'display: block', no s'ha d'utilitzar l'alineació vertical.",
			"Provides access to Sass's powerful selector engine.": "Proporciona accés al potent motor de selector de Sass.",
			"Provides functions that operate on numbers.": "Proporciona funcions que operen amb números.",
			"Removes quotes from a string.": "Elimina les cometes d'una cadena.",
			"Rename to '{0}'": "Canviar el nom a '{0}'",
			"Replaces $original with $replacement within $selector.": "Reemplaça $original per $replacement dins de $selector.",
			"Replaces the nth item in a list.": "Reemplaça l'element nth d'una llista.",
			"Returns a list of all keys in a map.": "Retorna una llista de totes les claus d'un mapa.",
			"Returns a list of all values in a map.": "Retorna una llista de tots els valors d'un mapa.",
			"Returns a new map with keys removed.": "Retorna un nou mapa amb claus eliminades.",
			"Returns a random number.": "Retorna un número aleatori.",
			"Returns a specific item in a list.": "Retorna un element específic d'una llista.",
			"Returns the absolute value of a number.": "Retorna el valor absolut d'un número.",
			"Returns the complement of a color.": "Retorna el complement d'un color.",
			"Returns the index of the first occurance of $substring in $string.": "Retorna l'índex de la primera instància de $substring en $string.",
			"Returns the inverse of a color.": "Retorna l'invers d'un color.",
			"Returns the keywords passed to a function that takes variable arguments.": "Retorna les paraules clau passades a una funció que pren arguments variables.",
			"Returns the length of a list.": "Retorna la longitud d'una llista.",
			"Returns the number of characters in a string.": "Retorna el nombre de caràcters d'una cadena.",
			"Returns the position of a value within a list.": "Retorna la posició d'un valor dins d'una llista.",
			"Returns the separator of a list.": "Retorna el separador d'una llista.",
			"Returns the simple selectors that comprise a compound selector.": "Retorna els selectors simples que componen un selector compost.",
			"Returns the string representation of a value as it would be represented in Sass.": "Retorna la representació de cadena d'un valor tal com es representaria en Sass.",
			"Returns the type of a value.": "Retorna el tipus d'un valor.",
			"Returns the unit(s) associated with a number.": "Retorna les unitats associades a un número.",
			"Returns the value in a map associated with a given key.": "Retorna el valor d'un mapa associat a una clau determinada.",
			"Returns whether $super matches all the elements $sub does, and possibly more.": "Retorna si $super coincideix amb tots els elements $sub i, possiblement, amb més.",
			"Returns whether a feature exists in the current Sass runtime.": "Retorna si existeix una característica en el temps d'execució de Sass actual.",
			"Returns whether a function with the given name exists.": "Retorna si existeix una funció amb el nom especificat.",
			"Returns whether a map has a value associated with a given key.": "Retorna si un mapa té un valor associat a una clau determinada.",
			"Returns whether a mixin with the given name exists.": "Retorna si existeix un mixin amb el nom especificat.",
			"Returns whether a number has units.": "Retorna si un número té unitats.",
			"Returns whether a variable with the given name exists in the current scope.": "Retorna si existeix una variable amb el nom especificat en l'àmbit actual.",
			"Returns whether a variable with the given name exists in the global scope.": "Retorna si existeix una variable amb el nom especificat en l'àmbit global.",
			"Returns whether two numbers can be added, subtracted, or compared.": "Retorna si es poden sumar, restar o comparar dos números.",
			"Rounds a number down to the previous whole number.": "Arrodoneix un número cap avall fins al número enter anterior.",
			"Rounds a number to the nearest whole number.": "Arrodoneix un número al número enter més proper.",
			"Rounds a number up to the next whole number.": "Arrodoneix un número cap amunt fins al següent número enter.",
			"Sass documentation": "Documentació de Sass",
			"Selector Specificity": "Especificitat del selector",
			"Selectors should not contain IDs because these rules are too tightly coupled with the HTML.": "Els selectors no haurien de contenir identificadors perquè aquestes regles estan massa lligades a l'HTML.",
			"The universal selector (*) is known to be slow": "Es sap que el selector universal \"*\" és lent.",
			"Throws the value of an expression as a fatal error with stack trace. Useful for validating arguments to mixins and functions.": "Llança el valor d'una expressió com un error fatal amb traça de pila. Útil per validar arguments en mixins i funcions.",
			"URI expected": "S'esperava l'URI",
			"URL encodes a string": "La URL codifica una cadena",
			"Unifies two selectors to produce a selector that matches elements matched by both.": "Unifica dos selectors per produir un selector que coincideixi amb els elements coincidents amb tots dos.",
			"Unknown at-rule.": "Regla at desconeguda.",
			"Unknown property.": "Propietat desconeguda.",
			"Unknown property: '{0}'": "Propietat desconeguda: \"{0}\"",
			"Unknown vendor specific property.": "Propietat específica del proveïdor desconeguda.",
			"When using a vendor-specific prefix also include the standard property": "Quan utilitzeu un prefix específic del proveïdor, incloeu també la propietat estàndard.",
			"When using a vendor-specific prefix make sure to also include all other vendor-specific properties": "Quan utilitzeu un prefix específic del proveïdor, assegureu-vos d'incloure també totes les altres propietats específiques del proveïdor.",
			"While loop that takes an expression and repeatedly outputs the nested styles until the statement evaluates to `false`.": "Bucle While que pren una expressió i genera repetidament els estils anidats fins que la instrucció s'avalua com a \"false\".",
			"[ expected": "S'esperava [",
			"] expected": "S'esperava ]",
			"absolute value of a number": "valor absolut d'un número",
			"arccosine - inverse of cosine function": "arcocosinus: invers de la funció de cosinus",
			"arcsine - inverse of sine function": "arcosinus: invers de la funció de sinus",
			"arctangent - inverse of tangent function": "arcotangent: invers de la funció tangent",
			"argument from \\'{0}\\'": "argument de \\'{0}\\'",
			"at-rule or selector expected": "s'esperava una regla at o un selector",
			"at-rule unknown": "regla at desconeguda",
			"bind the evaluation of a ruleset to each member of a list.": "lliga l'avaluació d'un conjunt de regles a cada membre d'una llista.",
			"calculates square root of a number": "calcula l'arrel quadrada d'un número",
			"colon expected": "S'esperaven dos punts",
			"comma expected": "S'esperava una coma",
			"condition expected": "condició esperada",
			"converts numbers from one type into another": "converteix números d'un tipus a un altre",
			"converts to a %, e.g. 0.5 > 50%": "es converteix en %, per exemple, 0,5 > 50%",
			"cosine function": "funció de cosinus",
			"creates a #AARRGGBB": "crea un #AARRGGBB",
			"creates a color": "crea un color",
			"dot expected": "S'esperava un punt",
			"escape string content": "contingut de cadena d'escapament",
			"expression expected": "s'esperava una expressió",
			"first argument modulus second argument": "primer argument mòdul segon argument",
			"first argument raised to the power of the second argument": "primer argument elevat a la potència del segon argument",
			"generate a list spanning a range of values": "generar una llista que abasti un interval de valors",
			"identifier expected": "s'esperava un identificador",
			"identifier or variable expected": "s'esperava un identificador o una variable",
			"identifier or wildcard expected": "s'esperava un identificador o un comodí",
			"inline-block is ignored due to the float. If 'float' has a value other than 'none', the box is floated and 'display' is treated as 'block'": "\"inline-block\" s'omet a causa del float. Si \"float\" té un valor diferent de \"none\", el quadre es flota i \"display\" es tracta com a \"block\"",
			"inlines a resource and falls back to `url()`": "col·loca en línia un recurs i torna a \"url()\"",
			"media query expected": "s'esperava una consulta de mitjans",
			"number expected": "s'esperava un número",
			"operator expected": "s'esperava un operador",
			"page directive or declaraton expected": "s'esperava una directiva de pàgina o una declaració",
			"parses a string to a color": "analitza una cadena en un color",
			"percentage expected": "percentatge esperat",
			"property value expected": "s'esperava un valor de propietat",
			"remove or change the unit of a dimension": "elimina o canvia la unitat d'una dimensió",
			"return `@color` 10% points darker": "retorna \"@color\" amb un 10% de punts més foscos",
			"return `@color` 10% points less saturated": "retorna \"@color\" amb un 10% menys de punts de saturació",
			"return `@color` 10% points less transparent": "retorna \"@color\" amb un 10% de punts menys transparents",
			"return `@color` 10% points lighter": "retorna \"@color\" amb un 10% més de punts de lluminositat",
			"return `@color` 10% points more saturated": "retorna \"@color\" amb un 10% més de punts de saturació",
			"return `@color` 10% points more transparent": "retorna \"@color\" amb un 10% més de punts de transparència",
			"return `@color` with 50% transparency": "retorna \"@color\" amb un 50% de transparència",
			"return `@color` with a 10 degree larger in hue": "retorna \"@color\" amb un to 10 graus més gran",
			"return `@darkcolor` if `@color1 is> 43% luma` otherwise return `@lightcolor`, see notes": "retorna \"@darkcolor\" si \"@color1 is> 43% luma\"; en cas contrari, retorna \"@lightcolor\". Consulteu les notes",
			"return a mix of `@color1` and `@color2`": "retorna una combinació de \"@color1\" i \"@color2\"",
			"returns a grey, 100% desaturated color": "retorna un color gris, 100% desaturat",
			"returns a value at the specified position in the list": "retorna un valor a la posició especificada de la llista",
			"returns one of two values depending on a condition.": "retorna un dels dos valors en funció d'una condició.",
			"returns pi": "retorna PI",
			"returns the `alpha` channel of `@color`": "retorna el canal \"alfa\" de \"@color\"",
			"returns the `blue` channel of `@color`": "retorna el canal \"blau\" de \"@color\"",
			"returns the `green` channel of `@color`": "retorna el canal \"verd\" de \"@color\"",
			"returns the `hue` channel of `@color` in the HSL space": "retorna el canal \"to\" de \"@color\" en l'espai HSL",
			"returns the `hue` channel of `@color` in the HSV space": "retorna el canal \"to\" de \"@color\" en l'espai HSV",
			"returns the `lightness` channel of `@color` in the HSL space": "retorna el canal \"lluminositat\" de \"@color\" en l'espai HSL",
			"returns the `luma` value (perceptual brightness) of `@color`": "retorna el valor \"luma\" (brillantor perceptual) de \"@color\"",
			"returns the `red` channel of `@color`": "retorna el canal \"vermell\" de \"@color\"",
			"returns the `saturation` channel of `@color` in the HSL space": "retorna el canal \"saturació\" de \"@color\" en l'espai HSL",
			"returns the `saturation` channel of `@color` in the HSV space": "retorna el canal \"saturació\" de \"@color\" en l'espai HSV",
			"returns the `value` channel of `@color` in the HSV space": "retorna el canal \"valor\" de \"@color\" en l'espai HSV",
			"returns the lowest of one or more values": "retorna el valor més baix d'un o més valors",
			"returns the number of elements in a value list": "retorna el nombre d'elements d'una llista de valors",
			"rounds a number to a number of places": "arrodoneix un número a un nombre de llocs decimals",
			"rounds down to an integer": "arrodoneix cap avall a un enter",
			"rounds up to an integer": "arrodoneix cap amunt a un enter",
			"selector expected": "s'esperava un selector",
			"semi-colon expected": "s'esperava un punt i coma",
			"sine function": "funció de sinus",
			"string literal expected": "s'esperava un literal de cadena",
			"string replace": "substitució de cadena",
			"tangent function": "funció de tangent",
			"term expected": "s'esperava un terme",
			"unknown keyword": "paraula clau desconeguda",
			"uri or string expected": "s'esperava un URI o una cadena",
			"variable name expected": "s'esperava un nom de variable",
			"variable value expected": "s'esperava un valor de variable",
			"whitespace expected": "s'esperava un espai en blanc",
			"wildcard expected": "s'esperava un comodí",
			"{ expected": "s'esperava {",
			"{0}, '{1}'": "{0}, \"{1}\"",
			"} expected": "s'esperava }"
		},
		"package": {
			"css.colorDecorators.enable.deprecationMessage": "El valor \"css.colorDecorators.enable\" està en desús en favor de \"editor.colorDecorators\".",
			"css.completion.completePropertyWithSemicolon.desc": "Insereix un punt i coma al final de la línia en completar les propietats CSS.",
			"css.completion.triggerPropertyValueCompletion.desc": "Per defecte, VS Code desencadena la finalització de valors de propietat després de seleccionar una propietat CSS. Utilitzeu aquesta opció per desactivar aquest comportament.",
			"css.customData.desc": "Una llista de rutes de fitxers relatives que apunten a fitxers JSON seguint el [format de dades personalitzades](https://github.com/microsoft/vscode-css-languageservice/blob/master/docs/customData.md).\r\n\r\nVS Code carrega les dades personalitzades en iniciar-se per millorar el seu suport de CSS per a les propietats CSS personalitzades, les directrius, les pseudoclases i els pseudoelements que especifiqueu en els fitxers JSON.\r\n\r\nLes rutes dels fitxers són relatives a l'espai de treball i només es consideren les configuracions de la carpeta de l'espai de treball.",
			"css.format.braceStyle.desc": "Posa claus a la mateixa línia que les regles ('collapse') o posa claus a la seva pròpia línia ('expand').",
			"css.format.enable.desc": "Habilita o deshabilita el formatador CSS predeterminat.",
			"css.format.maxPreserveNewLines.desc": "Nombre màxim de salts de línia que es conservaran en un fragment quan `#css.format.preserveNewLines#` estigui habilitat.",
			"css.format.newlineBetweenRules.desc": "Separa els conjunts de regles amb una línia en blanc.",
			"css.format.newlineBetweenSelectors.desc": "Separa els selectors amb una nova línia.",
			"css.format.preserveNewLines.desc": "Indica si s'han de conservar els salts de línia existents abans dels elements.",
			"css.format.spaceAroundSelectorSeparator.desc": "Assegureu-vos que hi hagi un caràcter d'espai al voltant dels separadors de selector '>', '+', '~' (per exemple, 'a > b').",
			"css.hover.documentation": "Mostra la documentació d'atributs i etiquetes mitjançant moviments del punter de CSS.",
			"css.hover.references": "Mostra les referències a MDN mitjançant moviments del punter de CSS.",
			"css.lint.argumentsInColorFunction.desc": "Nombre de paràmetres incorrecte.",
			"css.lint.boxModel.desc": "No utilitzeu \"width\" o \"height\" quan utilitzeu \"padding\" o \"border\".",
			"css.lint.compatibleVendorPrefixes.desc": "Quan utilitzeu un prefix específic del proveïdor, comproveu que també hàgiu inclòs la resta de propietats específiques del proveïdor.",
			"css.lint.duplicateProperties.desc": "No utilitzeu definicions d'estil duplicades.",
			"css.lint.emptyRules.desc": "No utilitzeu conjunts de regles buits.",
			"css.lint.float.desc": "Es recomana no utilitzar \"float\". Els valors float produeixen CSS fràgils que es poden danyar fàcilment si canvia qualsevol aspecte del disseny.",
			"css.lint.fontFaceProperties.desc": "La regla \"@font-face\" ha de definir les propietats \"src\" i \"font-family\".",
			"css.lint.hexColorLength.desc": "Els colors hexadecimals han d'estar formats per tres o sis números hexadecimals.",
			"css.lint.idSelector.desc": "Els selectors no han de contenir identificadors perquè aquestes regles estan estretament lligades a HTML.",
			"css.lint.ieHack.desc": "Les modificacions d'IE només són necessàries quan es dóna suport a IE7 i versions anteriors.",
			"css.lint.importStatement.desc": "Les instruccions Import no es carreguen en paral·lel.",
			"css.lint.important.desc": "Eviteu utilitzar `!important`. És una indicació que l'especificitat de tot el CSS s'ha sortit de control i ha de ser refactoritzada.",
			"css.lint.propertyIgnoredDueToDisplay.desc": "La propietat s'ignora a causa de la pantalla. Per exemple, amb \"display: inline\", les propietats \"width\", \"height\", \"margin-top\", \"margin-bottom\" i \"float\" no tenen cap efecte.",
			"css.lint.universalSelector.desc": "Se sap que el selector universal (\"*\") és lent.",
			"css.lint.unknownAtRules.desc": "Regla At desconeguda.",
			"css.lint.unknownProperties.desc": "Propietat desconeguda.",
			"css.lint.unknownVendorSpecificProperties.desc": "Propietat específica del proveïdor desconeguda.",
			"css.lint.validProperties.desc": "Llista de propietats que no es validen amb la regla \"unknownProperties\".",
			"css.lint.vendorPrefix.desc": "Quan utilitzeu un prefix específic del proveïdor, incloeu també la propietat estàndard.",
			"css.lint.zeroUnits.desc": "No es necessita una unitat per a zero.",
			"css.title": "CSS",
			"css.trace.server.desc": "Fa un seguiment de la comunicació entre VSCode i el servidor de llenguatge CSS.",
			"css.validate.desc": "Habilita o deshabilita totes les validacions.",
			"css.validate.title": "Controla la validació de CSS i la gravetat dels problemes.",
			"description": "Proporciona un potent suport de llenguatge per a fitxers CSS, LESS i SCSS.",
			"displayName": "Característiques del llenguatge CSS",
			"less.colorDecorators.enable.deprecationMessage": "El valor \"less.colorDecorators.enable\" està en desús en favor de \"editor.colorDecorators\".",
			"less.completion.completePropertyWithSemicolon.desc": "Insereix un punt i coma al final de la línia en completar les propietats CSS.",
			"less.completion.triggerPropertyValueCompletion.desc": "Per defecte, VS Code desencadena la finalització de valors de propietat després de seleccionar una propietat CSS. Utilitzeu aquesta opció per desactivar aquest comportament.",
			"less.format.braceStyle.desc": "Posa claus a la mateixa línia que les regles ('collapse') o posa claus a la seva pròpia línia ('expand').",
			"less.format.enable.desc": "Habilita o deshabilita el formatador LESS predeterminat.",
			"less.format.maxPreserveNewLines.desc": "Nombre màxim de salts de línia que es conservaran en un fragment quan `#less.format.preserveNewLines#` estigui habilitat.",
			"less.format.newlineBetweenRules.desc": "Separa els conjunts de regles amb una línia en blanc.",
			"less.format.newlineBetweenSelectors.desc": "Separa els selectors amb una nova línia.",
			"less.format.preserveNewLines.desc": "Indica si s'han de conservar els salts de línia existents abans dels elements.",
			"less.format.spaceAroundSelectorSeparator.desc": "Assegureu-vos que hi hagi un caràcter d'espai al voltant dels separadors de selector '>', '+', '~' (per exemple, 'a > b').",
			"less.hover.documentation": "Mostra la documentació d'atributs i etiquetes mitjançant moviments del punter de LESS.",
			"less.hover.references": "Mostra les referències a MDN mitjançant moviments del punter de LESS.",
			"less.lint.argumentsInColorFunction.desc": "Nombre de paràmetres incorrecte.",
			"less.lint.boxModel.desc": "No utilitzeu \"width\" o \"height\" quan utilitzeu \"padding\" o \"border\".",
			"less.lint.compatibleVendorPrefixes.desc": "Quan utilitzeu un prefix específic del proveïdor, comproveu que també hàgiu inclòs la resta de propietats específiques del proveïdor.",
			"less.lint.duplicateProperties.desc": "No utilitzeu definicions d'estil duplicades.",
			"less.lint.emptyRules.desc": "No utilitzeu conjunts de regles buits.",
			"less.lint.float.desc": "Es recomana no utilitzar \"float\". Els valors float produeixen CSS fràgils que es poden danyar fàcilment si canvia qualsevol aspecte del disseny.",
			"less.lint.fontFaceProperties.desc": "La regla \"@font-face\" ha de definir les propietats \"src\" i \"font-family\".",
			"less.lint.hexColorLength.desc": "Els colors hexadecimals han d'estar formats per tres o sis números hexadecimals.",
			"less.lint.idSelector.desc": "Els selectors no han de contenir identificadors perquè aquestes regles estan estretament lligades a HTML.",
			"less.lint.ieHack.desc": "Les modificacions d'IE només són necessàries quan es dóna suport a IE7 i versions anteriors.",
			"less.lint.importStatement.desc": "Les instruccions Import no es carreguen en paral·lel.",
			"less.lint.important.desc": "Eviteu utilitzar `!important`. És una indicació que l'especificitat de tot el CSS s'ha sortit de control i ha de ser refactoritzada.",
			"less.lint.propertyIgnoredDueToDisplay.desc": "La propietat s'ignora a causa de la pantalla. Per exemple, amb \"display: inline\", les propietats \"width\", \"height\", \"margin-top\", \"margin-bottom\" i \"float\" no tenen cap efecte.",
			"less.lint.universalSelector.desc": "Se sap que el selector universal (\"*\") és lent.",
			"less.lint.unknownAtRules.desc": "Regla At desconeguda.",
			"less.lint.unknownProperties.desc": "Propietat desconeguda.",
			"less.lint.unknownVendorSpecificProperties.desc": "Propietat específica del proveïdor desconeguda.",
			"less.lint.validProperties.desc": "Llista de propietats que no es validen amb la regla \"unknownProperties\".",
			"less.lint.vendorPrefix.desc": "Quan utilitzeu un prefix específic del proveïdor, incloeu també la propietat estàndard.",
			"less.lint.zeroUnits.desc": "No es necessita una unitat per a zero.",
			"less.title": "LESS",
			"less.validate.desc": "Habilita o deshabilita totes les validacions.",
			"less.validate.title": "Controla la validació de LESS i la gravetat dels problemes.",
			"scss.colorDecorators.enable.deprecationMessage": "El valor \"scss.colorDecorators.enable\" està en desús en favor de \"editor.colorDecorators\".",
			"scss.completion.completePropertyWithSemicolon.desc": "Insereix un punt i coma al final de la línia en completar les propietats CSS.",
			"scss.completion.triggerPropertyValueCompletion.desc": "Per defecte, VS Code desencadena la finalització de valors de propietat després de seleccionar una propietat CSS. Utilitzeu aquesta opció per desactivar aquest comportament.",
			"scss.format.braceStyle.desc": "Posa claus a la mateixa línia que les regles ('collapse') o posa claus a la seva pròpia línia ('expand').",
			"scss.format.enable.desc": "Habilita o deshabilita el formatador SCSS predeterminat.",
			"scss.format.maxPreserveNewLines.desc": "Nombre màxim de salts de línia que es conservaran en un fragment quan `#scss.format.preserveNewLines#` estigui habilitat.",
			"scss.format.newlineBetweenRules.desc": "Separa els conjunts de regles amb una línia en blanc.",
			"scss.format.newlineBetweenSelectors.desc": "Separa els selectors amb una nova línia.",
			"scss.format.preserveNewLines.desc": "Indica si s'han de conservar els salts de línia existents abans dels elements.",
			"scss.format.spaceAroundSelectorSeparator.desc": "Assegureu-vos que hi hagi un caràcter d'espai al voltant dels separadors de selector '>', '+', '~' (per exemple, 'a > b').",
			"scss.hover.documentation": "Mostra la documentació d'atributs i etiquetes mitjançant moviments del punter de SCSS.",
			"scss.hover.references": "Mostra les referències a MDN mitjançant moviments del punter de SCSS.",
			"scss.lint.argumentsInColorFunction.desc": "Nombre de paràmetres incorrecte.",
			"scss.lint.boxModel.desc": "No utilitzeu \"width\" o \"height\" quan utilitzeu \"padding\" o \"border\".",
			"scss.lint.compatibleVendorPrefixes.desc": "Quan utilitzeu un prefix específic del proveïdor, comproveu que també hàgiu inclòs la resta de propietats específiques del proveïdor.",
			"scss.lint.duplicateProperties.desc": "No utilitzeu definicions d'estil duplicades.",
			"scss.lint.emptyRules.desc": "No utilitzeu conjunts de regles buits.",
			"scss.lint.float.desc": "Es recomana no utilitzar \"float\". Els valors float produeixen CSS fràgils que es poden danyar fàcilment si canvia qualsevol aspecte del disseny.",
			"scss.lint.fontFaceProperties.desc": "La regla \"@font-face\" ha de definir les propietats \"src\" i \"font-family\".",
			"scss.lint.hexColorLength.desc": "Els colors hexadecimals han d'estar formats per tres o sis números hexadecimals.",
			"scss.lint.idSelector.desc": "Els selectors no han de contenir identificadors perquè aquestes regles estan estretament lligades a HTML.",
			"scss.lint.ieHack.desc": "Les modificacions d'IE només són necessàries quan es dóna suport a IE7 i versions anteriors.",
			"scss.lint.importStatement.desc": "Les instruccions Import no es carreguen en paral·lel.",
			"scss.lint.important.desc": "Eviteu utilitzar `!important`. És una indicació que l'especificitat de tot el CSS s'ha sortit de control i ha de ser refactoritzada.",
			"scss.lint.propertyIgnoredDueToDisplay.desc": "La propietat s'ignora a causa de la pantalla. Per exemple, amb \"display: inline\", les propietats \"width\", \"height\", \"margin-top\", \"margin-bottom\" i \"float\" no tenen cap efecte.",
			"scss.lint.universalSelector.desc": "Se sap que el selector universal (\"*\") és lent.",
			"scss.lint.unknownAtRules.desc": "Regla d'entrada desconeguda.",
			"scss.lint.unknownProperties.desc": "Propietat desconeguda.",
			"scss.lint.unknownVendorSpecificProperties.desc": "Propietat específica del proveïdor desconeguda.",
			"scss.lint.validProperties.desc": "Llista de propietats que no es validen amb la regla \"unknownProperties\".",
			"scss.lint.vendorPrefix.desc": "Quan utilitzeu un prefix específic del proveïdor, incloeu també la propietat estàndard.",
			"scss.lint.zeroUnits.desc": "No es necessita una unitat per a zero.",
			"scss.title": "SCSS (Sass)",
			"scss.validate.desc": "Habilita o deshabilita totes les validacions.",
			"scss.validate.title": "Controla la validació de SCSS i la gravetat dels problemes."
		}
	}
}